particle-iot/device-os/hal/src/nRF52840/ble_hal.cpp
private:
    bool isCachedDevice(const hal_ble_addr_t& address) const;
    int addCachedDevice(const hal_ble_addr_t& address);
    void clearCachedDevice();
    hal_ble_scan_result_evt_t* getPendingResult(const hal_ble_addr_t& address);
    int addPendingResult(const hal_ble_scan_result_evt_t& resultEvt);
    void removePendingResult(const hal_ble_addr_t& address);
    void clearPendingResult();
    int continueScanning();
    int constructObserverEvent(hal_ble_scan_result_evt_t& result, const ble_gap_evt_adv_report_t& advReport) const;
    void notifyScanResultEvent(const hal_ble_scan_result_evt_t& result);
    static void processObserverEvents(const ble_evt_t* event, void* context);
    static void onScanGuardTimerExpired(os_timer_t timer);

    bool observerInitialized_;
    volatile bool isScanning_;                              /**< If it is scanning or not. */
    hal_ble_scan_params_t scanParams_;                      /**< BLE scanning parameters. */
    os_semaphore_t scanSemaphore_;                          /**< Semaphore to wait until the scan procedure completed. */
    uint8_t scanReportBuff_[BLE_MAX_ADV_DATA_LEN_EXT];      /**< Buffer to hold the scanned report data. */
    ble_data_t bleScanData_;                                /**< BLE scanned data. */
    hal_ble_on_scan_result_cb_t scanResultCallback_;        /**< Callback function on scan result. */
    void* context_;                                         /**< Context of the scan result callback function. */
    os_timer_t scanGuardTimer_;                             /**< Timer to guard the scanning procedure is terminated successfully.  */
    Vector<hal_ble_addr_t> cachedDevices_;
    Vector<hal_ble_scan_result_evt_t> pendingResults_;
};

class BleObject::ConnectionsManager {
public:
    ConnectionsManager()
            : connMgrInitialized_(false),
              isConnecting_(false),
              disconnectingHandle_(BLE_INVALID_CONN_HANDLE),
              centralConnParamUpdateHandle_(BLE_INVALID_CONN_HANDLE),
              periphConnParamUpdateHandle_(BLE_INVALID_CONN_HANDLE),
              connParamsUpdateAttempts_(0),
              connParamsUpdateTimer_(nullptr),
              connParamsUpdateSemaphore_(nullptr),
              connectSemaphore_(nullptr),
              disconnectSemaphore_(nullptr),
              ecdhContextInit_(false) {
        connectingAddr_ = {};
        pairingConfig_ = {
            .version = BLE_API_VERSION,
            .size = sizeof(hal_ble_pairing_config_t),
            .io_caps = BLE_IO_CAPS_NONE,
            .algorithm = BLE_PAIRING_ALGORITHM_AUTO,
            .reserved = {}
        };
    }
    ~ConnectionsManager() = default;
    int init();
    bool initialized() const {
        return connMgrInitialized_;
    }
    int onPeripheralLinkEventCallback(hal_ble_on_link_evt_cb_t cb, void* context);
    int setPpcp(const hal_ble_conn_params_t* ppcp);
    int getPpcp(hal_ble_conn_params_t* ppcp) const;
    bool connecting(const hal_ble_addr_t* address) const;
    bool connected(const hal_ble_addr_t* address = nullptr);
    int connect(const hal_ble_conn_cfg_t* config, hal_ble_conn_handle_t* conn_handle);
    int connectCancel(const hal_ble_addr_t* address);
    int disconnect(hal_ble_conn_handle_t connHandle);
    int disconnectAll();
    int updateConnectionParams(hal_ble_conn_handle_t connHandle, const hal_ble_conn_params_t* params);
    int getConnectionInfo(hal_ble_conn_handle_t connHandle, hal_ble_conn_info_t* info);
    int setPairingConfig(const hal_ble_pairing_config_t* config);
    int getPairingConfig(hal_ble_pairing_config_t* config) const;
    int startPairing(hal_ble_conn_handle_t connHandle);
    int rejectPairing(hal_ble_conn_handle_t connHandle);
    int setPairingAuthData(hal_ble_conn_handle_t connHandle, const hal_ble_pairing_auth_data_t* auth);
    bool isPairing(hal_ble_conn_handle_t connHandle);
    bool isPaired(hal_ble_conn_handle_t connHandle);
    bool valid(hal_ble_conn_handle_t connHandle);
    ssize_t getAttMtu(hal_ble_conn_handle_t connHandle);
    bool attMtuExchanged(hal_ble_conn_handle_t connHandle);
    int processConnectedEventFromThread(const ble_evt_t* event);
    int processDisconnectedEventFromThread(const ble_evt_t* event);
    int processConnParamsUpdatedEventFromThread(const ble_evt_t* event);
    int processAttMtuExchangeEventFromThread(const ble_evt_t* event);
    int processSecurityEventFromThread(const ble_evt_t* event);

private:
    struct BleLinkEventHandler {
        hal_ble_on_link_evt_cb_t callback;
        void* context;
    };

    enum BlePairingState {
        BLE_PAIRING_STATE_NOT_INITIATED,
        BLE_PAIRING_STATE_SEC_REQ_RECEIVED, // Central
        BLE_PAIRING_STATE_SEC_REQ_SENT, // Peripheral
        BLE_PAIRING_STATE_PAIRING_REQ_SENT, // Central
        BLE_PAIRING_STATE_PAIRING_REQ_RECEIVED, // Peripheral
        BLE_PAIRING_STATE_PASSKEY_DISPLAY,
        BLE_PAIRING_STATE_PASSKEY_INPUT,
        BLE_PAIRING_STATE_REJECTED,
        BLE_PAIRING_STATE_PAIRED
    };

    struct BleConnection {
        hal_ble_conn_info_t info;
        BleLinkEventHandler handler; // It is used for central link only.
        bool isMtuExchanged;
        BlePairingState pairState;
        std::unique_ptr<ble_gap_lesc_p256_pk_t> peerPublicKey;
    };

    int initSecParams(const hal_ble_pairing_config_t& config, ble_gap_sec_params_t& params);
    int generateEcdhKeyPair();
    int publicKeysPrepare(BleConnection* connection);
    int computeDhkey(const uint8_t peerPublicKey[BLE_GAP_LESC_P256_PK_LEN], uint8_t dhKey[BLE_GAP_LESC_DHKEY_LEN]);
    int configureAttMtu(hal_ble_conn_handle_t connHandle, size_t effective);
    BleConnection* fetchConnection(hal_ble_conn_handle_t connHandle);
    BleConnection* fetchConnection(const hal_ble_addr_t* address);
    int addConnection(BleConnection&& connection);
    void removeConnection(hal_ble_conn_handle_t connHandle);
    void initiateConnParamsUpdateIfNeeded(const BleConnection* connection);
    bool isConnParamsFeeded(const hal_ble_conn_params_t* params) const;
    static ble_gap_conn_params_t toPlatformConnParams(const hal_ble_conn_params_t* halConnParams);
    static hal_ble_conn_params_t toHalConnParams(const ble_gap_conn_params_t* params);
    static uint8_t toPlatformIoCaps(hal_ble_pairing_io_caps_t ioCaps);
    static hal_ble_pairing_io_caps_t toHalIoCaps(uint8_t ioCaps);
    static void onConnParamsUpdateTimerExpired(os_timer_t timer);
    void notifyLinkEvent(const hal_ble_link_evt_t& event);
    static void processConnectionEvents(const ble_evt_t* event, void* context);

