particle-iot/device-os/hal/src/nRF52840/ble_hal.cpp
private:
    enum class DiscoveryProcedure {
        BLE_DISCOVERY_PROCEDURE_IDLE = 0,
        BLE_DISCOVERY_PROCEDURE_SERVICES = 1,
        BLE_DISCOVERY_PROCEDURE_CHARACTERISTICS = 2,
        BLE_DISCOVERY_PROCEDURE_DESCRIPTORS = 3,
    };

    struct Publisher {
        hal_ble_on_char_evt_cb_t callback;
        void* context;
        hal_ble_conn_handle_t connHandle;
        hal_ble_attr_handle_t valueHandle;
    };

    void resetDiscoveryState();
    bool readServiceUUID128IfNeeded() const;
    bool readCharacteristicUUID128IfNeeded() const;
    hal_ble_svc_t* findDiscoveredService(hal_ble_attr_handle_t attrHandle);
    hal_ble_char_t* findDiscoveredCharacteristic(hal_ble_attr_handle_t attrHandle);
    int addPublisher(hal_ble_conn_handle_t connHandle, hal_ble_attr_handle_t valueHandle, hal_ble_on_char_evt_cb_t callback, void* context);
    int removePublisher(hal_ble_conn_handle_t connHandle, hal_ble_attr_handle_t valueHandle);
    static void processGattClientEvents(const ble_evt_t* event, void* context);
    static void onAttMtuExchangeTimerExpired(os_timer_t timer);

    bool gattcInitialized_;
    volatile hal_ble_conn_handle_t attMtuExchangeConnHandle_;       /**< Current handle of the connection to execute ATT_MTU exchange procedure. */
    os_timer_t attMtuExchangeTimer_;                                /**< Timer used for sending the exchanging ATT_MTU request after connection established. */
    uint8_t attMtuExchangeRetries_;
    bool discoverAll_;                                              /**< If it is going to discover all service during the service discovery procedure. */
    hal_ble_on_disc_service_cb_t discSvcCallback_;                  /**< Callback function on services discovered. */
    void* discSvcContext_;                                          /**< Context of services discovered callback function. */
    hal_ble_on_disc_char_cb_t discCharCallback_;                    /**< Callback function on characteristics discovered. */
    void* discCharContext_;                                         /**< Context of characteristics discovered callback function. */
    volatile bool isDiscovering_;                                   /**< If there is on-going discovery procedure. */
    hal_ble_conn_handle_t currDiscConnHandle_;                      /**< Current connection handle under which the service and characteristics to be discovered. */
    DiscoveryProcedure currDiscProcedure_;                          /**< Current discovery procedure. */
    hal_ble_svc_t currDiscSvc_;                                     /**< Current service to be discovered for the characteristics. */
    os_semaphore_t discoverySemaphore_;                             /**< Semaphore to wait until the discovery procedure completed. */
    volatile bool isReading_;
    hal_ble_conn_handle_t currReadConnHandle_;
    os_semaphore_t readSemaphore_;                                  /**< Semaphore to wait until the read operation completed. */
    volatile bool isWriting_;
    hal_ble_conn_handle_t currWriteConnHandle_;
    os_semaphore_t writeSemaphore_;                                 /**< Semaphore to wait until the write operation completed. */
    Vector<hal_ble_svc_t> discServices_;                            /**< Discover services. */
    Vector<hal_ble_char_t> discCharacteristics_;                    /**< Discovered characteristics. */
    hal_ble_attr_handle_t readAttrHandle_;                          /**< Current handle of which attribute to be read. */
    uint8_t* readBuf_;                                              /**< Current buffer to be filled for the read data. */
    size_t readLen_;                                                /**< Length of read data. */
    Vector<Publisher> publishers_;

    static constexpr uint8_t ATT_MTU_AUTO_EXCHANGE_RETRIES = 5;
};

int BleObject::BleEventDispatcher::init() {
    if (os_queue_create(&evtQueue_, sizeof(ble_evt_t*), BLE_EVENT_QUEUE_ITEM_COUNT, nullptr)) {
        evtQueue_ = nullptr;
        LOG(ERROR, "os_queue_create() failed");
        goto error;
    }
    if (os_thread_create(&evtThread_, "BLE Event Thread", OS_THREAD_PRIORITY_NETWORK, processBleEventFromThread, this, BLE_EVENT_THREAD_STACK_SIZE)) {
        evtThread_ = nullptr;
        LOG(ERROR, "os_thread_create() failed");
        goto error;
    }
    if (pool_.init(BLE_EVT_DATA_POOL_SIZE) != SYSTEM_ERROR_NONE) {
        goto error;
    }
    evtDispatcherinitialized_ = true;
    return SYSTEM_ERROR_NONE;
error:
    if (evtQueue_) {
        os_queue_destroy(evtQueue_, nullptr);
        evtQueue_ = nullptr;
    }
    if (evtThread_) {
        os_thread_exit(evtThread_);
        evtThread_ = nullptr;
    }
    return SYSTEM_ERROR_INTERNAL;
}

void BleObject::BleEventDispatcher::enqueue(ble_evt_t** event) {
    if (os_queue_put(evtQueue_, event, 0, nullptr)) {
        LOG(ERROR, "os_queue_put() failed.");
        SPARK_ASSERT(false);
    }
}

void BleObject::BleEventDispatcher::enqueue(const ble_evt_t* event) {
    ble_evt_t* pBleEvent = (ble_evt_t*)allocEventData(sizeof(ble_evt_t));
    if (!pBleEvent) {
        LOG(ERROR, "Allocate memory for BLE event failed.");
        SPARK_ASSERT(false);
    }
    memcpy(pBleEvent, event, sizeof(ble_evt_t));
    enqueue(&pBleEvent);
}

os_thread_return_t BleObject::BleEventDispatcher::processBleEventFromThread(void* param) {
    BleEventDispatcher* dispatcher = static_cast<BleEventDispatcher*>(param);
    while (1) {
        ble_evt_t* event;
        if (!os_queue_take(dispatcher->evtQueue_, &event, CONCURRENT_WAIT_FOREVER, nullptr)) {
            SCOPE_GUARD ({
                dispatcher->freeEventData(event);
            });
            switch (event->header.evt_id) {
                case BLE_GAP_EVT_ADV_SET_TERMINATED: {
                    BleObject::getInstance().broadcaster()->processAdvStoppedEventFromThread(event);
                    break;
                }
                case BLE_GAP_EVT_ADV_REPORT: {
                    BleObject::getInstance().observer()->processAdvReportEventFromThread(event);
                    break;
                }
                case BLE_GAP_EVT_CONNECTED: {
                    BleObject::getInstance().connMgr()->processConnectedEventFromThread(event);
                    break;
                }
                case BLE_GAP_EVT_DISCONNECTED: {
                    BleObject::getInstance().connMgr()->processDisconnectedEventFromThread(event);
                    break;
                }
                case BLE_GAP_EVT_CONN_PARAM_UPDATE: {
                    BleObject::getInstance().connMgr()->processConnParamsUpdatedEventFromThread(event);
                    break;
                }
                case BLE_GATTC_EVT_EXCHANGE_MTU_RSP:
                case BLE_GATTS_EVT_EXCHANGE_MTU_REQUEST: {
                    BleObject::getInstance().connMgr()->processAttMtuExchangeEventFromThread(event);
                    break;
                }
                case BLE_GATTC_EVT_PRIM_SRVC_DISC_RSP: {
                    BleObject::getInstance().gattc()->processSvcDiscEventFromThread(event);
                    break;
                }
                case BLE_GATTC_EVT_CHAR_DISC_RSP: {
                    BleObject::getInstance().gattc()->processCharDiscEventFromThread(event);
                    break;
                }
                case BLE_GATTC_EVT_DESC_DISC_RSP: {
                    BleObject::getInstance().gattc()->processDescDiscEventFromThread(event);
                    break;
                }
                case BLE_GATTC_EVT_READ_RSP: {
                    BleObject::getInstance().gattc()->processDataReadEventFromThread(event);
                    break;
                }
                case BLE_GATTS_EVT_WRITE: {
                    BleObject::getInstance().gatts()->processDataWrittenEventFromThread(event);
                    break;
                }
                case BLE_GATTC_EVT_HVX: {
                    BleObject::getInstance().gattc()->processDataNotifiedEventFromThread(event);
                    break;
                }
                case BLE_GAP_EVT_SEC_INFO_REQUEST:
                case BLE_GAP_EVT_LESC_DHKEY_REQUEST:
                case BLE_GAP_EVT_PASSKEY_DISPLAY:
                case BLE_GAP_EVT_AUTH_KEY_REQUEST:
                case BLE_GAP_EVT_SEC_REQUEST:
                case BLE_GAP_EVT_SEC_PARAMS_REQUEST:
                case BLE_GAP_EVT_AUTH_STATUS:
                case BLE_GAP_EVT_CONN_SEC_UPDATE: {
                    BleObject::getInstance().connMgr()->processSecurityEventFromThread(event);
                    break;
                }
                default: {
                    break;
                }
            }
        } else {
            LOG(ERROR, "BLE event thread exited.");
            break;
        }
    }
    os_thread_exit(dispatcher->evtThread_);
}

struct BleGapImpl {
    BleObject::BleGap* instance;
};
