particle-iot/device-os/hal/src/nRF52840/ble_hal.cpp
int BleObject::Observer::stopScanning() {
    if (!isScanning_) {
        return SYSTEM_ERROR_NONE;
    }
    if (os_timer_is_active(scanGuardTimer_, nullptr)) {
        os_timer_change(scanGuardTimer_, OS_TIMER_CHANGE_STOP, hal_interrupt_is_isr() ? true : false, 0, 0, nullptr);
    }
    // Ignore the returned value, as the SoftDevice might be messed up considering the device is not in scanning state,
    // but wee neeed to give the semaphore to unblock the thread that initiated the scanning procedure.
    if (sd_ble_gap_scan_stop() != NRF_SUCCESS) {
        LOG(ERROR, "Device is not in scanning state.");
    }
    bool give = false;
    ATOMIC_BLOCK() {
        if (isScanning_) {
            isScanning_ = false;
            give = true;
        }
    }
    if (give) {
        os_semaphore_give(scanSemaphore_, false);
    }
    return SYSTEM_ERROR_NONE;
}

ble_gap_scan_params_t BleObject::Observer::toPlatformScanParams() const {
    ble_gap_scan_params_t params = {};
    params.extended = ( (scanParams_.scan_phys & BLE_PHYS_CODED) != 0) ? 0x01 : 0x00; /**< Extended must be 1 if using Coded PHY */
    params.active = scanParams_.active;
    params.interval = scanParams_.interval;
    params.window = scanParams_.window;
    params.timeout = scanParams_.timeout;
    params.scan_phys = scanParams_.scan_phys;
    if (scanParams_.scan_phys == (BLE_PHYS_1MBPS | BLE_PHYS_CODED)) { /**< Special case: Dual PHY scanning */
        if (params.window > (params.interval / 2)) {
            params.window = params.interval / 2;                      /**< Limit window to interval/2 */
        }
    }   
    params.filter_policy = scanParams_.filter_policy;
    return params;
}

bool BleObject::Observer::isCachedDevice(const hal_ble_addr_t& address) const {
    for (const auto& addr : cachedDevices_) {
        if (addressEqual(addr, address)) {
            return true;
        }
    }
    return false;
}

int BleObject::Observer::addCachedDevice(const hal_ble_addr_t& address) {
    CHECK_TRUE(cachedDevices_.append(address), SYSTEM_ERROR_NO_MEMORY);
    return SYSTEM_ERROR_NONE;
}

void BleObject::Observer::clearCachedDevice() {
    cachedDevices_.clear();
}

hal_ble_scan_result_evt_t* BleObject::Observer::getPendingResult(const hal_ble_addr_t& address) {
    for (auto& result : pendingResults_) {
        if (addressEqual(result.peer_addr, address)) {
            return &result;
        }
    }
    return nullptr;
}

int BleObject::Observer::addPendingResult(const hal_ble_scan_result_evt_t& result) {
    if (getPendingResult(result.peer_addr) != nullptr) {
        return SYSTEM_ERROR_INTERNAL;
    }
    CHECK_TRUE(pendingResults_.append(result), SYSTEM_ERROR_NO_MEMORY);
    return SYSTEM_ERROR_NONE;
}

void BleObject::Observer::removePendingResult(const hal_ble_addr_t& address) {
    // Note: this function isn't responsible for freeing the memory allocated for the advertising data.
    for (int i = 0; i < pendingResults_.size(); i = i) {
        if (addressEqual(pendingResults_[i].peer_addr, address)) {
            pendingResults_.removeAt(i);
            continue;
        }
        i++;
    }
}

void BleObject::Observer::clearPendingResult() {
    // Note: this function is responsible for freeing the memory allocated for the advertising data.
    for (const auto& result : pendingResults_) {
        if (result.adv_data) {
            BleObject::getInstance().dispatcher()->freeEventData(result.adv_data);
        }
    }
    pendingResults_.clear();
}

int BleObject::Observer::constructObserverEvent(hal_ble_scan_result_evt_t& result, const ble_gap_evt_adv_report_t& advReport) const {
    if (!advReport.type.scan_response) {
        // Advertising data packet
        result.type.connectable = advReport.type.connectable;
        result.type.scannable = advReport.type.scannable;
        result.type.directed = advReport.type.directed;
        result.type.extended_pdu = advReport.type.extended_pdu;
        result.rssi = advReport.rssi;
        result.peer_addr = toHalAddress(advReport.peer_addr);
        result.adv_data_len = advReport.data.len;
        result.adv_data = advReport.data.p_data;
    } else {
        // Scan response data packet
        result.sr_data_len = advReport.data.len;
        result.sr_data = advReport.data.p_data;
    }
    return SYSTEM_ERROR_NONE;
}

void BleObject::Observer::notifyScanResultEvent(const hal_ble_scan_result_evt_t& result) {
    if (scanResultCallback_) {
        scanResultCallback_(&result, context_);
    }
    // Free the cached advertising data and scan response data.
    if (result.adv_data) {
        BleObject::getInstance().dispatcher()->freeEventData(result.adv_data);
    }
    if (result.sr_data) {
        BleObject::getInstance().dispatcher()->freeEventData(result.sr_data);
    }
}

int BleObject::Observer::processAdvReportEventFromThread(const ble_evt_t* event) {
    if (!isScanning_) {
        if (event->evt.gap_evt.params.adv_report.data.p_data) {
            BleObject::getInstance().dispatcher()->freeEventData(event->evt.gap_evt.params.adv_report.data.p_data);
        }
        return SYSTEM_ERROR_INVALID_STATE;
    }
    const ble_gap_evt_adv_report_t& advReport = event->evt.gap_evt.params.adv_report;
    hal_ble_addr_t newAddr = toHalAddress(advReport.peer_addr);
    if (isCachedDevice(newAddr)) {
        // This has been checked in the ISR. Check it here just for sure.
        // Free the allocated RAM for the advertising data.
        goto free;
    }
    if ((!scanParams_.active || !advReport.type.scannable) && !advReport.type.scan_response) {
        // No scan response data is expected.
        hal_ble_scan_result_evt_t result = {};
        constructObserverEvent(result, advReport);
        notifyScanResultEvent(result);
        addCachedDevice(newAddr);
        goto continue_scanning;
    }
    if (!advReport.type.scan_response) {
        // Advertising data packet
        hal_ble_scan_result_evt_t result = {};
        constructObserverEvent(result, advReport);
        if (addPendingResult(result) != SYSTEM_ERROR_NONE) {
            // This has been checked in the ISR. Check it here just for sure.
            // Duplicated pending result. Free the allocated RAM for the advertising data.
            goto free;
        }
    } else {
        // Scan response data packet
        hal_ble_scan_result_evt_t* result = getPendingResult(newAddr);
        if (!result) {
            goto free;
        }
        constructObserverEvent(*result, advReport);
        notifyScanResultEvent(*result);
        addCachedDevice(newAddr);
        removePendingResult(newAddr);
    }
    goto continue_scanning;
free:
    if (advReport.data.p_data) {
        BleObject::getInstance().dispatcher()->freeEventData(advReport.data.p_data);
    }
continue_scanning:
    continueScanning();
    return SYSTEM_ERROR_NONE;
}

void BleObject::Observer::processObserverEvents(const ble_evt_t* event, void* context) {
    Observer* observer = static_cast<ObserverImpl*>(context)->instance;
    switch (event->header.evt_id) {
        case BLE_GAP_EVT_ADV_REPORT: {
            // Check the advertising report before enqueue the event to accelerate the SD event processing,
            // and decrease the usage of the BLE event pool.
            if (!observer->isScanning_) {
                break;
            }
            const ble_gap_evt_adv_report_t& report = event->evt.gap_evt.params.adv_report;
            hal_ble_addr_t newAddr = toHalAddress(report.peer_addr);
            if (observer->isCachedDevice(newAddr)) {
                observer->continueScanning();
                break;
            }
            if (observer->scanParams_.active && report.type.scannable && !report.type.scan_response) {
                // Advertising data packet, scan response data is expected.
                if (observer->getPendingResult(newAddr) != nullptr) {
                    observer->continueScanning();
                    break;
                }
            }
            ble_evt_t* observerEvent = (ble_evt_t*)BleObject::getInstance().dispatcher()->allocEventData(sizeof(ble_evt_t));
            if (!observerEvent) {
                LOG(ERROR, "Allocate memory for BLE event failed.");
                observer->stopScanning();
                break;
            }
            // Copy the SoftDevice event.
            memcpy(observerEvent, event, sizeof(ble_evt_t));
            ble_gap_evt_adv_report_t& advReport = observerEvent->evt.gap_evt.params.adv_report;
            if (event->evt.gap_evt.params.adv_report.data.len > 0) {
                advReport.data.p_data = (uint8_t*)BleObject::getInstance().dispatcher()->allocEventData(advReport.data.len);
                if (!advReport.data.p_data) {
                    LOG(ERROR, "Allocate memory for adv report data failed.");
                    BleObject::getInstance().dispatcher()->freeEventData(observerEvent);
                    observer->stopScanning();
                    break;
                }
                // Copy the advertising packet data payload.
                memcpy(advReport.data.p_data, event->evt.gap_evt.params.adv_report.data.p_data, advReport.data.len);
            } else {
                advReport.data.p_data = nullptr;
            }
            BleObject::getInstance().dispatcher()->enqueue(&observerEvent);
            break;
        }
        case BLE_GAP_EVT_TIMEOUT: {
            if (event->evt.gap_evt.params.timeout.src == BLE_GAP_TIMEOUT_SRC_SCAN) {
                LOG_DEBUG(TRACE, "BLE GAP event: Scanning timeout");
                if (observer->isScanning_) {
                    observer->isScanning_ = false;
                    os_semaphore_give(observer->scanSemaphore_, false);
                    if (os_timer_is_active(observer->scanGuardTimer_, nullptr)) {
                        os_timer_change(observer->scanGuardTimer_, OS_TIMER_CHANGE_STOP, true, 0, 0, nullptr);
                    }
                }
            }
            break;
        }
        default: {
            break;
        }
    }
}

