particle-iot/device-os/hal/src/nRF52840/ble_hal.cpp
int BleObject::ConnectionsManager::setPairingConfig(const hal_ble_pairing_config_t* config) {
    CHECK_TRUE(config, SYSTEM_ERROR_INVALID_ARGUMENT);
    pairingConfig_ = {};
    pairingConfig_.size = sizeof(hal_ble_pairing_config_t);
    memcpy(&pairingConfig_, config, std::min(pairingConfig_.size, config->size));
    return SYSTEM_ERROR_NONE;
}

int BleObject::ConnectionsManager::getPairingConfig(hal_ble_pairing_config_t* config) const {
    CHECK_TRUE(config, SYSTEM_ERROR_INVALID_ARGUMENT);
    memcpy(config, &pairingConfig_, std::min(pairingConfig_.size, config->size));
    return SYSTEM_ERROR_NONE;
}

int BleObject::ConnectionsManager::startPairing(hal_ble_conn_handle_t connHandle) {
    BleConnection* connection = fetchConnection(connHandle);
    CHECK_TRUE(connection, SYSTEM_ERROR_NOT_FOUND);
    CHECK_TRUE(connection->pairState == BLE_PAIRING_STATE_NOT_INITIATED ||
               connection->pairState == BLE_PAIRING_STATE_REJECTED ||
               connection->pairState == BLE_PAIRING_STATE_SEC_REQ_RECEIVED, SYSTEM_ERROR_INVALID_STATE);
    ble_gap_sec_params_t secParams = {};
    initSecParams(pairingConfig_, secParams);
    LOG_DEBUG(TRACE, "Own security params: %d, %d, %d, %d, %d, %d", secParams.bond, secParams.mitm, secParams.lesc, secParams.io_caps, secParams.keypress, secParams.oob);
    int ret = sd_ble_gap_authenticate(connection->info.conn_handle, &secParams);
    if (ret != NRF_SUCCESS) {
        connection->pairState = BLE_PAIRING_STATE_NOT_INITIATED;
        hal_ble_link_evt_t linkEvent = {};
        linkEvent.type = BLE_EVT_PAIRING_STATUS_UPDATED;
        linkEvent.conn_handle = connection->info.conn_handle;
        linkEvent.params.pairing_status.status = nrf_system_error(ret);
        notifyLinkEvent(linkEvent);
        return nrf_system_error(ret);
    }
    if (connection->info.role == BLE_ROLE_CENTRAL) {
        connection->pairState = BLE_PAIRING_STATE_PAIRING_REQ_SENT;
        LOG_DEBUG(TRACE, "Secure request is sent successfully.");
    } else {
        connection->pairState = BLE_PAIRING_STATE_SEC_REQ_SENT;
        LOG_DEBUG(TRACE, "Pairing request is sent successfully.");
    }
    return SYSTEM_ERROR_NONE;
}

int BleObject::ConnectionsManager::rejectPairing(hal_ble_conn_handle_t connHandle) {
    BleConnection* connection = fetchConnection(connHandle);
    CHECK_TRUE(connection, SYSTEM_ERROR_NOT_FOUND);
    switch (connection->pairState) {
        case BLE_PAIRING_STATE_SEC_REQ_RECEIVED: {
            int ret = sd_ble_gap_authenticate(connection->info.conn_handle, nullptr);
            CHECK_NRF_RETURN(ret, nrf_system_error(ret));
            // We should not tamper the pairing state to be out of sync with the SoftDevice.
            // Only if the SD call returns success we then mark the pairing state as rejected.
            connection->pairState = BLE_PAIRING_STATE_REJECTED;
            break;
        }
        case BLE_PAIRING_STATE_PAIRING_REQ_RECEIVED: {
            int ret = sd_ble_gap_sec_params_reply(connHandle, BLE_GAP_SEC_STATUS_PAIRING_NOT_SUPP, nullptr, nullptr);
            CHECK_NRF_RETURN(ret, nrf_system_error(ret));
            connection->pairState = BLE_PAIRING_STATE_REJECTED;
            break;
        }
        case BLE_GAP_EVT_PASSKEY_DISPLAY:
        case BLE_PAIRING_STATE_PASSKEY_INPUT: {
            int ret = sd_ble_gap_auth_key_reply(connHandle, BLE_GAP_AUTH_KEY_TYPE_NONE, nullptr);
            CHECK_NRF_RETURN(ret, nrf_system_error(ret));
            connection->pairState = BLE_PAIRING_STATE_REJECTED;
            break;
        }
        default: {
            return SYSTEM_ERROR_INVALID_STATE;
        }
    }
    return SYSTEM_ERROR_NONE;
}

int BleObject::ConnectionsManager::setPairingAuthData(hal_ble_conn_handle_t connHandle, const hal_ble_pairing_auth_data_t* auth) {
    CHECK_TRUE(auth, SYSTEM_ERROR_INVALID_ARGUMENT);
    BleConnection* connection = fetchConnection(connHandle);
    CHECK_TRUE(connection, SYSTEM_ERROR_NOT_FOUND);
    int ret;
    if (auth->type == BLE_PAIRING_AUTH_DATA_NUMERIC_COMPARISON) {
        CHECK_TRUE(connection->pairState == BLE_PAIRING_STATE_PASSKEY_DISPLAY, SYSTEM_ERROR_INVALID_STATE);
        if (auth->params.equal) {
            ret = sd_ble_gap_auth_key_reply(connHandle, BLE_GAP_AUTH_KEY_TYPE_PASSKEY, nullptr);
        } else {
            return rejectPairing(connHandle);
        }
    } else if (auth->type == BLE_PAIRING_AUTH_DATA_PASSKEY) {
        CHECK_TRUE(connection->pairState == BLE_PAIRING_STATE_PASSKEY_INPUT, SYSTEM_ERROR_INVALID_STATE);
        for (uint8_t i = 0; i < BLE_PAIRING_PASSKEY_LEN; i++) {
            if (!std::isdigit(auth->params.passkey[i])) {
                LOG(ERROR, "Invalid digits.");
                return rejectPairing(connHandle);
            }
        }
        ret = sd_ble_gap_auth_key_reply(connHandle, BLE_GAP_AUTH_KEY_TYPE_PASSKEY, auth->params.passkey);
    } else {
        return SYSTEM_ERROR_NOT_SUPPORTED;
    }
    return nrf_system_error(ret);
}

bool BleObject::ConnectionsManager::isPairing(hal_ble_conn_handle_t connHandle) {
    BleConnection* connection = fetchConnection(connHandle);
    CHECK_TRUE(connection, false);
    return (connection->pairState != BLE_PAIRING_STATE_NOT_INITIATED && 
            connection->pairState != BLE_PAIRING_STATE_PAIRED && 
            connection->pairState != BLE_PAIRING_STATE_REJECTED);
}

bool BleObject::ConnectionsManager::isPaired(hal_ble_conn_handle_t connHandle) {
    BleConnection* connection = fetchConnection(connHandle);
    CHECK_TRUE(connection, false);
    return connection->pairState == BLE_PAIRING_STATE_PAIRED;
}

bool BleObject::ConnectionsManager::valid(hal_ble_conn_handle_t connHandle) {
    const BleConnection* connection = fetchConnection(connHandle);
    return connection != nullptr;
}

ble_gap_conn_params_t BleObject::ConnectionsManager::toPlatformConnParams(const hal_ble_conn_params_t* halConnParams) {
    ble_gap_conn_params_t params = {};
    params.min_conn_interval = halConnParams->min_conn_interval;
    params.max_conn_interval = halConnParams->max_conn_interval;
    params.slave_latency = halConnParams->slave_latency;
    params.conn_sup_timeout = halConnParams->conn_sup_timeout;
    return params;
}

hal_ble_conn_params_t BleObject::ConnectionsManager::toHalConnParams(const ble_gap_conn_params_t* params) {
    hal_ble_conn_params_t halConnParams = {};
    halConnParams.version = BLE_API_VERSION;
    halConnParams.size = sizeof(hal_ble_conn_params_t);
    halConnParams.min_conn_interval = params->min_conn_interval;
    halConnParams.max_conn_interval = params->max_conn_interval;
    halConnParams.slave_latency = params->slave_latency;
    halConnParams.conn_sup_timeout = params->conn_sup_timeout;
    return halConnParams;
}

uint8_t BleObject::ConnectionsManager::toPlatformIoCaps(hal_ble_pairing_io_caps_t ioCaps) {
    switch (ioCaps) {
        case BLE_IO_CAPS_DISPLAY_ONLY: return BLE_GAP_IO_CAPS_DISPLAY_ONLY;
        case BLE_IO_CAPS_DISPLAY_YESNO: return BLE_GAP_IO_CAPS_DISPLAY_YESNO;
        case BLE_IO_CAPS_KEYBOARD_ONLY: return BLE_GAP_IO_CAPS_KEYBOARD_ONLY;
        case BLE_IO_CAPS_KEYBOARD_DISPLAY: return BLE_GAP_IO_CAPS_KEYBOARD_DISPLAY;
        default: return BLE_GAP_IO_CAPS_NONE;
    }
}

hal_ble_pairing_io_caps_t BleObject::ConnectionsManager::toHalIoCaps(uint8_t ioCaps) {
    switch (ioCaps) {
        case BLE_GAP_IO_CAPS_DISPLAY_ONLY: return BLE_IO_CAPS_DISPLAY_ONLY;
        case BLE_GAP_IO_CAPS_DISPLAY_YESNO: return BLE_IO_CAPS_DISPLAY_YESNO;
        case BLE_GAP_IO_CAPS_KEYBOARD_ONLY: return BLE_IO_CAPS_KEYBOARD_ONLY;
        case BLE_GAP_IO_CAPS_KEYBOARD_DISPLAY: return BLE_IO_CAPS_KEYBOARD_DISPLAY;
        default: return BLE_IO_CAPS_NONE;
    }
}

ssize_t BleObject::ConnectionsManager::getAttMtu(hal_ble_conn_handle_t connHandle) {
    const auto connection = fetchConnection(connHandle);
    CHECK_TRUE(connection, SYSTEM_ERROR_NOT_FOUND);
    return connection->info.att_mtu;
}

int BleObject::ConnectionsManager::configureAttMtu(hal_ble_conn_handle_t connHandle, size_t effective) {
    auto connection = fetchConnection(connHandle);
    CHECK_TRUE(connection, SYSTEM_ERROR_NOT_FOUND);
    connection->info.att_mtu = effective;
    connection->isMtuExchanged = true;
    return SYSTEM_ERROR_NONE;
}

bool BleObject::ConnectionsManager::attMtuExchanged(hal_ble_conn_handle_t connHandle) {
    const auto connection = fetchConnection(connHandle);
    CHECK_TRUE(connection, false);
    return connection->isMtuExchanged;
}

