particle-iot/device-os/hal/src/nRF52840/ble_hal.cpp
BleObject::ConnectionsManager::BleConnection* BleObject::ConnectionsManager::fetchConnection(hal_ble_conn_handle_t connHandle) {
    CHECK_TRUE(connHandle != BLE_INVALID_CONN_HANDLE, nullptr);
    for (auto& connection : connections_) {
        if (connection.info.conn_handle == connHandle) {
            return &connection;
        }
    }
    return nullptr;
}

BleObject::ConnectionsManager::BleConnection* BleObject::ConnectionsManager::fetchConnection(const hal_ble_addr_t* address) {
    CHECK_TRUE(address, nullptr);
    for (auto& connection : connections_) {
        if (addressEqual(connection.info.address, *address)) {
            return &connection;
        }
    }
    return nullptr;
}

int BleObject::ConnectionsManager::addConnection(BleConnection&& connection) {
    CHECK_TRUE(fetchConnection(connection.info.conn_handle) == nullptr, SYSTEM_ERROR_INTERNAL);
    CHECK_TRUE(connections_.append(std::move(connection)), SYSTEM_ERROR_NO_MEMORY);
    return SYSTEM_ERROR_NONE;
}

void BleObject::ConnectionsManager::removeConnection(hal_ble_conn_handle_t connHandle) {
    size_t i = 0;
    for (const auto& connection : connections_) {
        if (connection.info.conn_handle == connHandle) {
            connections_.removeAt(i);
            return;
        }
        i++;
    }
}

void BleObject::ConnectionsManager::initiateConnParamsUpdateIfNeeded(const BleConnection* connection) {
    if (connParamsUpdateTimer_ == nullptr) {
        return;
    }
    if (connParamsUpdateAttempts_ == 0 && periphConnParamUpdateHandle_ != BLE_INVALID_CONN_HANDLE) {
        // If the peripheral connection parameters update procedure has been initiated by application.
        return;
    }
    if (isConnParamsFeeded(&connection->info.conn_params)) {
        return;
    }
    if (connParamsUpdateAttempts_ < BLE_CONN_PARAMS_UPDATE_ATTEMPS) {
        if (!os_timer_change(connParamsUpdateTimer_, OS_TIMER_CHANGE_START, false, 0, 0, nullptr)) {
            periphConnParamUpdateHandle_ = connection->info.conn_handle;
            LOG_DEBUG(TRACE, "Attempts to update BLE connection parameters, try: %d after %d ms", connParamsUpdateAttempts_, BLE_CONN_PARAMS_UPDATE_DELAY_MS);
        }
        return;
    }
    periphConnParamUpdateHandle_ = BLE_INVALID_CONN_HANDLE;
    connParamsUpdateAttempts_ = 0;
    sd_ble_gap_disconnect(connection->info.conn_handle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
    LOG_DEBUG(TRACE, "Disconnecting. Update BLE connection parameters failed.");
}

bool BleObject::ConnectionsManager::isConnParamsFeeded(const hal_ble_conn_params_t* params) const {
    hal_ble_conn_params_t ppcp = {};
    CHECK_RETURN(getPpcp(&ppcp), true);
    uint16_t minAcceptedSl = ppcp.slave_latency - std::min((uint16_t)BLE_CONN_PARAMS_SLAVE_LATENCY_ERR, ppcp.slave_latency);
    uint16_t maxAcceptedSl = ppcp.slave_latency + BLE_CONN_PARAMS_SLAVE_LATENCY_ERR;
    uint16_t minAcceptedTo = ppcp.conn_sup_timeout - std::min((uint16_t)BLE_CONN_PARAMS_TIMEOUT_ERR, ppcp.conn_sup_timeout);
    uint16_t maxAcceptedTo = ppcp.conn_sup_timeout + BLE_CONN_PARAMS_TIMEOUT_ERR;
    if (params->max_conn_interval < ppcp.min_conn_interval || params->max_conn_interval > ppcp.max_conn_interval) {
        return false;
    }
    if (params->slave_latency < minAcceptedSl || params->slave_latency > maxAcceptedSl) {
        return false;
    }
    if (params->conn_sup_timeout < minAcceptedTo || params->conn_sup_timeout > maxAcceptedTo) {
        return false;
    }
    return true;
}

void BleObject::ConnectionsManager::onConnParamsUpdateTimerExpired(os_timer_t timer) {
    ConnectionsManager* connMgr;
    os_timer_get_id(timer, (void**)&connMgr);
    if (connMgr->periphConnParamUpdateHandle_ == BLE_INVALID_CONN_HANDLE) {
        return;
    }
    // For Peripheral, it will use the PPCP characteristic value.
    int ret = sd_ble_gap_conn_param_update(connMgr->periphConnParamUpdateHandle_, nullptr);
    if (ret != NRF_SUCCESS) {
        connMgr->periphConnParamUpdateHandle_ = BLE_INVALID_CONN_HANDLE;
        connMgr->connParamsUpdateAttempts_ = 0;
        sd_ble_gap_disconnect(connMgr->periphConnParamUpdateHandle_, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
        LOG_DEBUG(TRACE, "Disconnecting. Update BLE connection parameters failed.");
        return;
    }
    connMgr->connParamsUpdateAttempts_++;
}

void BleObject::ConnectionsManager::notifyLinkEvent(const hal_ble_link_evt_t& event) {
    BleConnection* connection = fetchConnection(event.conn_handle);
    if (connection) {
        if (connection->info.role == BLE_ROLE_CENTRAL) {
            if (connection->handler.callback) {
                connection->handler.callback(&event, connection->handler.context);
            }
        } else {
            for (const auto& handler : peripheralLinkEventHandlers_) {
                if (handler.callback) {
                    handler.callback(&event, handler.context);
                }
            }
        }
    }
}

int BleObject::ConnectionsManager::processConnectedEventFromThread(const ble_evt_t* event) {
    const ble_gap_evt_connected_t& connected = event->evt.gap_evt.params.connected;
    BleConnection connection = {};
    connection.info.version = BLE_API_VERSION;
    connection.info.size = sizeof(hal_ble_conn_info_t);
    connection.info.role = (hal_ble_role_t)connected.role;
    connection.info.conn_handle = event->evt.gap_evt.conn_handle;
    connection.info.conn_params = toHalConnParams(&connected.conn_params);
    connection.info.address = toHalAddress(connected.peer_addr);
    connection.info.att_mtu = BLE_DEFAULT_ATT_MTU_SIZE; // Use the default ATT_MTU on connected.
    connection.isMtuExchanged = false;
    connection.pairState = BLE_PAIRING_STATE_NOT_INITIATED;
    int ret = addConnection(std::move(connection));
    if (ret != SYSTEM_ERROR_NONE) {
        LOG(ERROR, "Add new connection failed. Disconnects from peer.");
        if (sd_ble_gap_disconnect(connection.info.conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION) != NRF_SUCCESS) {
            LOG(ERROR, "sd_ble_gap_disconnect() failed.");
        }
        return ret;
    }
    LOG_DEBUG(TRACE, "BLE role: %d, connection handle: %d", connection.info.role, connection.info.conn_handle);
    LOG_DEBUG(TRACE, "| interval(ms)  latency  timeout(ms) |");
    LOG_DEBUG(TRACE, "  %d*1.25          %d       %d*10", connection.info.conn_params.max_conn_interval,
            connection.info.conn_params.slave_latency, connection.info.conn_params.conn_sup_timeout);
    if (connection.info.role == BLE_ROLE_PERIPHERAL) {
        // Update connection parameters if needed.
        connParamsUpdateAttempts_ = 0;
        initiateConnParamsUpdateIfNeeded(&connection);
        // Notify the connected event.
        hal_ble_link_evt_t linkEvent = {};
        linkEvent.type = BLE_EVT_CONNECTED;
        linkEvent.conn_handle = connection.info.conn_handle;
        linkEvent.params.connected.info = &connection.info;
        notifyLinkEvent(linkEvent);
    }
    // If the connection is initiated by Central.
    if (isConnecting_ && connection.info.role == BLE_ROLE_CENTRAL && addressEqual(connection.info.address, connectingAddr_)) {
        isConnecting_ = false;
        os_semaphore_give(connectSemaphore_, false);
    }
    return SYSTEM_ERROR_NONE;
}

int BleObject::ConnectionsManager::processDisconnectedEventFromThread(const ble_evt_t* event) {
    const ble_gap_evt_disconnected_t& disconnected = event->evt.gap_evt.params.disconnected;
    BleConnection* connection = fetchConnection(event->evt.gap_evt.conn_handle);
    if (!connection) {
        LOG(ERROR, "Connection not found.");
        return SYSTEM_ERROR_NOT_FOUND;
    }
    // Cancel the on-going connection parameters update procedure.
    if (periphConnParamUpdateHandle_ == connection->info.conn_handle) {
        if (os_timer_is_active(connParamsUpdateTimer_, nullptr)) {
            connParamsUpdateAttempts_ = 0;
            periphConnParamUpdateHandle_ = BLE_INVALID_CONN_HANDLE;
            os_timer_change(connParamsUpdateTimer_, OS_TIMER_CHANGE_STOP, false, 0, 0, nullptr);
        } else {
            periphConnParamUpdateHandle_ = BLE_INVALID_CONN_HANDLE;
            os_semaphore_give(connParamsUpdateSemaphore_, false);
        }
    }
    if (centralConnParamUpdateHandle_ == connection->info.conn_handle) {
        centralConnParamUpdateHandle_ = BLE_INVALID_CONN_HANDLE;
        os_semaphore_give(connParamsUpdateSemaphore_, false);
    }
    // Remove the GATTS subscriber.
    BleObject::getInstance().gatts()->removeSubscriberFromAllCharacteristics(connection->info.conn_handle);
    // Remove the publishers on this connection.
    BleObject::getInstance().gattc()->removeAllPublishersOfConnection(connection->info.conn_handle);
    // If the disconnection is initiated by application.
    if (disconnectingHandle_ == connection->info.conn_handle) {
        os_semaphore_give(disconnectSemaphore_, false);
    } else {
        // Notify the disconnected event.
        hal_ble_link_evt_t linkEvent = {};
        linkEvent.type = BLE_EVT_DISCONNECTED;
        linkEvent.conn_handle = connection->info.conn_handle;
        linkEvent.params.disconnected.reason = disconnected.reason;
        notifyLinkEvent(linkEvent);
    }
    removeConnection(connection->info.conn_handle);
    return SYSTEM_ERROR_NONE;
}

int BleObject::ConnectionsManager::processSecurityEventFromThread(const ble_evt_t* event) {
    BleConnection* connection = fetchConnection(event->evt.gap_evt.conn_handle);
    CHECK_TRUE(connection, SYSTEM_ERROR_NOT_FOUND);
    CHECK_TRUE(connection->pairState != BLE_PAIRING_STATE_PAIRED, SYSTEM_ERROR_INVALID_STATE);
    if (event->header.evt_id == BLE_GAP_EVT_SEC_REQUEST) {
        LOG_DEBUG(TRACE, "BLE event: BLE_GAP_EVT_SEC_REQUEST");
        if (connection->info.role == BLE_ROLE_CENTRAL) {
            connection->pairState = BLE_PAIRING_STATE_SEC_REQ_RECEIVED;
            hal_ble_link_evt_t linkEvent = {};
            linkEvent.type = BLE_EVT_PAIRING_REQUEST_RECEIVED;
            linkEvent.conn_handle = connection->info.conn_handle;
            notifyLinkEvent(linkEvent);
            // User application may call rejectPairing() to update the pairing state in event handler
            if (connection->pairState != BLE_PAIRING_STATE_REJECTED) {
                const ble_gap_evt_sec_request_t& secRequest = event->evt.gap_evt.params.sec_request;
                if (pairingConfig_.algorithm == BLE_PAIRING_ALGORITHM_LESC_ONLY) {
                    if (secRequest.lesc == false) {
                        rejectPairing(event->evt.gap_evt.conn_handle);
                    }
                }
                return startPairing(event->evt.gap_evt.conn_handle);
            }
        }
    } else if (event->header.evt_id == BLE_GAP_EVT_SEC_PARAMS_REQUEST) {
        LOG_DEBUG(TRACE, "BLE event: BLE_GAP_EVT_SEC_PARAMS_REQUEST");
        const ble_gap_sec_params_t& peerSecParams = event->evt.gap_evt.params.sec_params_request.peer_params;
        LOG_DEBUG(TRACE, "Peer bond:%d, mitm:%d, lesc:%d, iocaps:%d, keypress:%d, oob:%d",
            peerSecParams.bond, peerSecParams.mitm, peerSecParams.lesc, toHalIoCaps(peerSecParams.io_caps), peerSecParams.keypress, peerSecParams.oob);
        int ret = NRF_SUCCESS;
        if (connection->info.role == BLE_ROLE_PERIPHERAL) {
            // If peripheral requests to pair, don't notify the event.
            if (connection->pairState != BLE_PAIRING_STATE_SEC_REQ_SENT) {
                connection->pairState = BLE_PAIRING_STATE_PAIRING_REQ_RECEIVED;
                hal_ble_link_evt_t linkEvent = {};
                linkEvent.type = BLE_EVT_PAIRING_REQUEST_RECEIVED;
                linkEvent.conn_handle = connection->info.conn_handle;
                notifyLinkEvent(linkEvent);
            }
        }
        // User application may call rejectPairing() to update the pairing state in event handler
        if (connection->pairState == BLE_PAIRING_STATE_REJECTED) {
            return ret;
        }
        ble_gap_sec_params_t secParams = {};
        ble_gap_sec_params_t* pSecParams = nullptr; // For central role, default it to nullptr, since we have set the secure parameters in startPairing().
        ble_gap_sec_keyset_t keyset = {};
        ble_gap_sec_keyset_t* pKeyset = nullptr; // nullptr for BLE legacy pairing
        bool reject = false;
        if (pairingConfig_.algorithm == BLE_PAIRING_ALGORITHM_LESC_ONLY) {
            if (peerSecParams.lesc == false) {
                reject = true;
            }
        }
        if (!reject && pairingConfig_.algorithm != BLE_PAIRING_ALGORITHM_LEGACY_ONLY ) {
            if (publicKeysPrepare(connection) != SYSTEM_ERROR_NONE) {
                LOG(ERROR, "Failed to allocate memory for public keys.");
                reject = true;
            } else {
                keyset.keys_own.p_pk = localPublicKey_.get();
                keyset.keys_peer.p_pk = connection->peerPublicKey.get();
                pKeyset = &keyset;
            }
        }
        if (!reject && connection->info.role == BLE_ROLE_PERIPHERAL) {
            initSecParams(pairingConfig_, secParams);
            pSecParams = &secParams;
        }
        ret = sd_ble_gap_sec_params_reply(event->evt.gap_evt.conn_handle, reject ? BLE_GAP_SEC_STATUS_PAIRING_NOT_SUPP : BLE_GAP_SEC_STATUS_SUCCESS, pSecParams, pKeyset);
        if (ret != NRF_SUCCESS) {
            connection->peerPublicKey.reset();
            // At this point, the BLE_GAP_EVT_AUTH_STATUS won't get triggered,
            // But we need to notify user that the pairing has failed.
            connection->pairState = BLE_PAIRING_STATE_NOT_INITIATED;
            hal_ble_link_evt_t linkEvent = {};
            linkEvent.type = BLE_EVT_PAIRING_STATUS_UPDATED;
            linkEvent.conn_handle = connection->info.conn_handle;
            linkEvent.params.pairing_status.status = nrf_system_error(ret);
            notifyLinkEvent(linkEvent);
            LOG(ERROR, "sd_ble_gap_sec_params_reply() failed: %u", (unsigned)ret);
        }
    } else if (event->header.evt_id == BLE_GAP_EVT_PASSKEY_DISPLAY) {
        LOG_DEBUG(TRACE, "BLE event: BLE_GAP_EVT_PASSKEY_DISPLAY");
        connection->pairState = BLE_PAIRING_STATE_PASSKEY_DISPLAY;
        const ble_gap_evt_passkey_display_t& passkeyDisplay = event->evt.gap_evt.params.passkey_display;
        hal_ble_link_evt_t linkEvent = {};
        if (passkeyDisplay.match_request) {
            linkEvent.type = BLE_EVT_PAIRING_NUMERIC_COMPARISON;
        } else {
            linkEvent.type = BLE_EVT_PAIRING_PASSKEY_DISPLAY;
        }
        linkEvent.conn_handle = connection->info.conn_handle;
        linkEvent.params.passkey_display.passkey = passkeyDisplay.passkey;
        notifyLinkEvent(linkEvent);
    } else if (event->header.evt_id == BLE_GAP_EVT_AUTH_KEY_REQUEST) {
        LOG_DEBUG(TRACE, "BLE event: BLE_GAP_EVT_AUTH_KEY_REQUEST");
        connection->pairState = BLE_PAIRING_STATE_PASSKEY_INPUT;
        const ble_gap_evt_auth_key_request_t& keyRequest = event->evt.gap_evt.params.auth_key_request;
        if (keyRequest.key_type == BLE_GAP_AUTH_KEY_TYPE_PASSKEY) {
            hal_ble_link_evt_t linkEvent = {};
            linkEvent.type = BLE_EVT_PAIRING_PASSKEY_INPUT;
            linkEvent.conn_handle = connection->info.conn_handle;
            notifyLinkEvent(linkEvent);
        } else {
            LOG(ERROR, "OOB data not supported!");
        }
    } else if (event->header.evt_id == BLE_GAP_EVT_CONN_SEC_UPDATE) {
        LOG_DEBUG(TRACE, "BLE event: BLE_GAP_EVT_CONN_SEC_UPDATE");
        // const ble_gap_evt_conn_sec_update_t& secUpdate = event->evt.gap_evt.params.conn_sec_update;
        // LOG_DEBUG(TRACE, "Secure mode: %d, level: %d", secUpdate.conn_sec.sec_mode.sm, secUpdate.conn_sec.sec_mode.lv);
    } else if (event->header.evt_id == BLE_GAP_EVT_AUTH_STATUS) {
        LOG_DEBUG(TRACE, "BLE event: BLE_GAP_EVT_AUTH_STATUS");
        // Now we can safely free the memory for peer public key
        connection->peerPublicKey.reset();
        const ble_gap_evt_auth_status_t& authStatus = event->evt.gap_evt.params.auth_status;
        LOG_DEBUG(TRACE, "Authen status: 0x%02X, reason: %d, bond: %d, lesc: %d", authStatus.auth_status, authStatus.error_src, authStatus.bonded, authStatus.lesc);
        if (authStatus.auth_status == BLE_GAP_SEC_STATUS_SUCCESS) {
            connection->pairState = BLE_PAIRING_STATE_PAIRED;
        } else {
            connection->pairState = BLE_PAIRING_STATE_NOT_INITIATED;
        }
        hal_ble_link_evt_t linkEvent = {};
        linkEvent.type = BLE_EVT_PAIRING_STATUS_UPDATED;
        linkEvent.conn_handle = connection->info.conn_handle;
        linkEvent.params.pairing_status.status = authStatus.auth_status;
        linkEvent.params.pairing_status.bonded = authStatus.bonded;
        linkEvent.params.pairing_status.lesc = authStatus.lesc;
        notifyLinkEvent(linkEvent);
        if (authStatus.lesc) {
            /* To protect a device's private key, a device should implement a method to
            * prevent an attacker from retrieving useful information about the device's private
            *  key. For this purpose, a device should change its private key after every pairing
            * (successful or failed). Otherwise, it should change its private key whenever S +
            * 3F > 8, where S is the number of successful pairings and F the number of
            * failed attempts since the key was last changed. */
            generateEcdhKeyPair();
        }
    } else if (event->header.evt_id == BLE_GAP_EVT_LESC_DHKEY_REQUEST) {
        LOG_DEBUG(TRACE, "BLE event: BLE_GAP_EVT_LESC_DHKEY_REQUEST");
        const ble_gap_evt_lesc_dhkey_request_t& dhkeyReq = event->evt.gap_evt.params.lesc_dhkey_request;
        ble_gap_lesc_dhkey_t dhkey = {};
        if (computeDhkey(dhkeyReq.p_pk_peer->pk, dhkey.key) != SYSTEM_ERROR_NONE) {
            LOG(ERROR, "Failed to compute DHKey.");
            // Set an invalid DHKey to terminate the pairing progress.
            mbedtls_default_rng(nullptr, dhkey.key, BLE_GAP_LESC_DHKEY_LEN);
        }
        int ret = sd_ble_gap_lesc_dhkey_reply(connection->info.conn_handle, &dhkey);
        if (ret != NRF_SUCCESS) {
            LOG(ERROR, "sd_ble_gap_lesc_dhkey_reply() failed: %d.", ret);
            return nrf_system_error(ret);
        }
    } else {
        LOG_DEBUG(TRACE, "Unhandled BLE security event: %d", event->header.evt_id);
    }
    return SYSTEM_ERROR_NONE;
}

int BleObject::ConnectionsManager::processConnParamsUpdatedEventFromThread(const ble_evt_t* event) {
    const ble_gap_evt_conn_param_update_t& connParamsUpdate = event->evt.gap_evt.params.conn_param_update;
    BleConnection* connection = fetchConnection(event->evt.gap_evt.conn_handle);
    if (!connection) {
        LOG(ERROR, "Connection not found.");
        return SYSTEM_ERROR_NOT_FOUND;
    }
    connection->info.conn_params = toHalConnParams(&connParamsUpdate.conn_params);
    LOG_DEBUG(TRACE, "| interval(ms)  latency  timeout(ms) |");
    LOG_DEBUG(TRACE, "  %d*1.25          %d       %d*10", connection->info.conn_params.max_conn_interval,
            connection->info.conn_params.slave_latency, connection->info.conn_params.conn_sup_timeout);
    // Notify the connection parameters updated event.
    hal_ble_link_evt_t linkEvent = {};
    linkEvent.type = BLE_EVT_CONN_PARAMS_UPDATED;
    linkEvent.conn_handle = connection->info.conn_handle;
    linkEvent.params.conn_params_updated.conn_params = &connection->info.conn_params;
    notifyLinkEvent(linkEvent);
    if (periphConnParamUpdateHandle_ == connection->info.conn_handle) {
        if (connParamsUpdateAttempts_ != 0) {
            initiateConnParamsUpdateIfNeeded(connection);
        } else {
            periphConnParamUpdateHandle_ = BLE_INVALID_CONN_HANDLE;
            os_semaphore_give(connParamsUpdateSemaphore_, false);
        }
    }
    if (centralConnParamUpdateHandle_ == connection->info.conn_handle) {
        centralConnParamUpdateHandle_ = BLE_INVALID_CONN_HANDLE;
        os_semaphore_give(connParamsUpdateSemaphore_, false);
    }
    return SYSTEM_ERROR_NONE;
}

int BleObject::ConnectionsManager::processAttMtuExchangeEventFromThread(const ble_evt_t* event) {
    size_t effectAttMtu;
    size_t desiredAttMtu = BleObject::getInstance().gatts()->getDesiredAttMtu();
    if (event->header.evt_id == BLE_GATTS_EVT_EXCHANGE_MTU_REQUEST) {
        const ble_gatts_evt_exchange_mtu_request_t& mtuRequest = event->evt.gatts_evt.params.exchange_mtu_request;
        effectAttMtu = std::min((size_t)mtuRequest.client_rx_mtu, desiredAttMtu);
    } else if (event->header.evt_id == BLE_GATTC_EVT_EXCHANGE_MTU_RSP) {
        const ble_gattc_evt_exchange_mtu_rsp_t& attMtuRsp = event->evt.gattc_evt.params.exchange_mtu_rsp;
        effectAttMtu = std::min((size_t)attMtuRsp.server_rx_mtu, desiredAttMtu);
    } else {
        return SYSTEM_ERROR_INTERNAL;
    }
    effectAttMtu = std::max(effectAttMtu, (size_t)BLE_MIN_ATT_MTU_SIZE);
    LOG_DEBUG(TRACE, "Effective ATT MTU: %d.", effectAttMtu);
    configureAttMtu(event->evt.gatts_evt.conn_handle, effectAttMtu);
    // Notify the ATT MTU updated event.
    hal_ble_link_evt_t linkEvent = {};
    linkEvent.type = BLE_EVT_ATT_MTU_UPDATED;
    linkEvent.conn_handle = event->evt.gatts_evt.conn_handle;
    linkEvent.params.att_mtu_updated.att_mtu_size = effectAttMtu;
    notifyLinkEvent(linkEvent);
    return SYSTEM_ERROR_NONE;
}

