particle-iot/device-os/hal/src/nRF52840/ble_hal.cpp
int BleObject::GattServer::setDesiredAttMtu(size_t attMtu) {
    CHECK_TRUE(attMtu >= BLE_MIN_ATT_MTU_SIZE && attMtu <= BLE_MAX_ATT_MTU_SIZE, SYSTEM_ERROR_INVALID_ARGUMENT);
    desiredAttMtu_ = attMtu;
    return SYSTEM_ERROR_NONE;
}

size_t BleObject::GattServer::getDesiredAttMtu() const {
    return desiredAttMtu_;
}

bool BleObject::GattServer::findService(hal_ble_attr_handle_t svcHandle) const {
    for (const auto& handle : services_) {
        if (handle == svcHandle) {
            return true;
        }
    }
    return false;
}

BleObject::GattServer::BleCharacteristic* BleObject::GattServer::findCharacteristic(hal_ble_attr_handle_t attrHandle) {
    for (auto& characteristic : characteristics_) {
        if (characteristic.charHandles.value_handle == attrHandle ||
                characteristic.charHandles.decl_handle == attrHandle ||
                characteristic.charHandles.user_desc_handle == attrHandle ||
                characteristic.charHandles.cccd_handle == attrHandle ||
                characteristic.charHandles.sccd_handle == attrHandle) {
            return &characteristic;
        }
    }
    return nullptr;
}

int BleObject::GattServer::addSubscriber(BleCharacteristic* characteristic, hal_ble_conn_handle_t connHandle, ble_sig_cccd_value_t value) {
    for (auto& subscriber : characteristic->subscribers) {
        if (subscriber.connHandle == connHandle) {
            subscriber.config = value;
            return SYSTEM_ERROR_NONE;
        }
    }
    Subscriber subscriber = {};
    subscriber.connHandle = connHandle;
    subscriber.config = value;
    CHECK_TRUE(characteristic->subscribers.append(subscriber), SYSTEM_ERROR_NO_MEMORY);
    return SYSTEM_ERROR_NONE;
}

void BleObject::GattServer::removeSubscriber(BleCharacteristic* characteristic, hal_ble_conn_handle_t connHandle) {
    size_t i = 0;
    for (auto& subscriber : characteristic->subscribers) {
        if (subscriber.connHandle == connHandle) {
            characteristic->subscribers.removeAt(i);
            return;
        }
        i++;
    }
}

void BleObject::GattServer::removeSubscriberFromAllCharacteristics(hal_ble_conn_handle_t connHandle) {
    for (auto& characteristic : characteristics_) {
        removeSubscriber(&characteristic, connHandle);
    }
}

int BleObject::GattServer::processDataWrittenEventFromThread(ble_evt_t* event) {
    ble_gatts_evt_write_t& write = event->evt.gatts_evt.params.write;
    BleCharacteristic* characteristic = findCharacteristic(write.handle);
    if (!characteristic) {
        // Writing to the GAP characteristics shouldn't log error.
        return SYSTEM_ERROR_NOT_FOUND;
    }
    hal_ble_char_evt_t charEvent = {};
    charEvent.conn_handle = event->evt.gatts_evt.conn_handle;
    charEvent.attr_handle = write.handle;
    if (characteristic->charHandles.cccd_handle == write.handle && write.len == sizeof(uint16_t)) {
        uint16_t cccd = ((uint16_t)write.data[1] << 8 | (uint16_t)write.data[0]) & BLE_SIG_CCCD_VAL_NOTI_IND;
        if (!(characteristic->properties & BLE_SIG_CHAR_PROP_NOTIFY)) {
            cccd &= ~BLE_SIG_CCCD_VAL_NOTIFICATION;
        }
        if (!(characteristic->properties & BLE_SIG_CHAR_PROP_INDICATE)) {
            cccd &= ~BLE_SIG_CCCD_VAL_INDICATION;
        }
        if (cccd > 0) {
            CHECK(addSubscriber(characteristic, event->evt.gatts_evt.conn_handle, (ble_sig_cccd_value_t)cccd));
        } else {
            removeSubscriber(characteristic, event->evt.gatts_evt.conn_handle);
        }
        charEvent.type = BLE_EVT_CHAR_CCCD_UPDATED;
        charEvent.params.cccd_config.value = (ble_sig_cccd_value_t)cccd;
    } else if (characteristic->charHandles.value_handle == write.handle) {
        charEvent.type = BLE_EVT_DATA_WRITTEN;
        charEvent.params.data_written.offset = write.offset;
        charEvent.params.data_written.len = write.len;
        charEvent.params.data_written.data = write.data;
    } else {
        return SYSTEM_ERROR_NOT_SUPPORTED;
    }
    if (characteristic->callback) {
        characteristic->callback(&charEvent, characteristic->context);
    }
    return SYSTEM_ERROR_NONE;
}

void BleObject::GattServer::processGattServerEvents(const ble_evt_t* event, void* context) {
    GattServer* gatts = static_cast<GattServerImpl*>(context)->instance;
    switch (event->header.evt_id) {
        case BLE_GAP_EVT_DISCONNECTED: {
            if (gatts->isHvxing_ && gatts->currHvxConnHandle_ == event->evt.gap_evt.conn_handle) {
                gatts->isHvxing_ = false;
                os_semaphore_give(gatts->hvxSemaphore_, false);
            }
            break;
        }
        case BLE_GATTS_EVT_SYS_ATTR_MISSING: {
            LOG_DEBUG(TRACE, "BLE GATT Server event: system attribute is missing.");
            // No persistent system attributes
            const uint32_t ret = sd_ble_gatts_sys_attr_set(event->evt.gatts_evt.conn_handle, nullptr, 0, 0);
            if (ret != NRF_SUCCESS) {
                LOG(ERROR, "sd_ble_gatts_sys_attr_set() failed: %u", (unsigned)ret);
            }
            break;
        }
        case BLE_GATTS_EVT_WRITE: {
            LOG_DEBUG(TRACE, "BLE GATT Server event: data written.");
            ble_evt_t* dataWrittenEvent = (ble_evt_t*)BleObject::getInstance().dispatcher()->allocEventData(sizeof(ble_evt_t) +
                    SUB1(event->evt.gatts_evt.params.write.len) * sizeof(uint8_t));
            if (!dataWrittenEvent) {
                LOG(ERROR, "Allocate memory for received data failed.");
                break;
            }
            memcpy(dataWrittenEvent, event, sizeof(ble_evt_t));
            ble_gatts_evt_write_t& dataWritten = dataWrittenEvent->evt.gatts_evt.params.write;
            memcpy(dataWritten.data, event->evt.gatts_evt.params.write.data, dataWritten.len);
            BleObject::getInstance().dispatcher()->enqueue(&dataWrittenEvent);
            break;
        }
        case BLE_GATTS_EVT_HVN_TX_COMPLETE: {
            LOG_DEBUG(TRACE, "BLE GATT Server event: notification sent.");
            if (gatts->isHvxing_ && gatts->currHvxConnHandle_ == event->evt.gatts_evt.conn_handle) {
                gatts->isHvxing_ = false;
                os_semaphore_give(gatts->hvxSemaphore_, false);
            }
            break;
        }
        case BLE_GATTS_EVT_HVC: {
            LOG_DEBUG(TRACE, "BLE GATT Server event: indication confirmed.");
            if (gatts->isHvxing_ && gatts->currHvxConnHandle_ == event->evt.gatts_evt.conn_handle) {
                gatts->isHvxing_ = false;
                os_semaphore_give(gatts->hvxSemaphore_, false);
            }
            break;
        }
        case BLE_GATTS_EVT_EXCHANGE_MTU_REQUEST: {
            LOG_DEBUG(TRACE, "BLE GATT Server event: exchange ATT MTU request: %d, desired: %d",
                    event->evt.gatts_evt.params.exchange_mtu_request.client_rx_mtu, gatts->desiredAttMtu_);
            int ret = sd_ble_gatts_exchange_mtu_reply(event->evt.gatts_evt.conn_handle, gatts->desiredAttMtu_);
            if (ret != NRF_SUCCESS) {
                LOG_DEBUG(TRACE, "sd_ble_gatts_exchange_mtu_reply() failed: %d", ret);
                break;
            }
            BleObject::getInstance().dispatcher()->enqueue(event);
            break;
        }
        case BLE_GATTS_EVT_TIMEOUT: {
            LOG_DEBUG(TRACE, "BLE GATT Server event: timeout, source: %d.", event->evt.gatts_evt.params.timeout.src);
            // Disconnect on GATT Server timeout event.
            int ret = sd_ble_gap_disconnect(event->evt.gatts_evt.conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            if (ret != NRF_SUCCESS) {
                LOG(ERROR, "sd_ble_gap_disconnect() failed: %u", (unsigned)ret);
            }
            if (gatts->isHvxing_ && gatts->currHvxConnHandle_ == event->evt.gatts_evt.conn_handle) {
                gatts->isHvxing_ = false;
                os_semaphore_give(gatts->hvxSemaphore_, false);
            }
            break;
        }
        default: {
            break;
        }
    }
}

struct GattClientImpl {
    BleObject::GattClient* instance;
};
static GattClientImpl gattcImpl;

int BleObject::GattClient::init() {
    if (os_semaphore_create(&discoverySemaphore_, 1, 0)) {
        discoverySemaphore_ = nullptr;
        LOG(ERROR, "os_semaphore_create() failed");
        goto error;
    }
    if (os_semaphore_create(&readSemaphore_, 1, 0)) {
        readSemaphore_ = nullptr;
        LOG(ERROR, "os_semaphore_create() failed");
        goto error;
    }
    if (os_semaphore_create(&writeSemaphore_, 1, 0)) {
        writeSemaphore_ = nullptr;
        LOG(ERROR, "os_semaphore_create() failed");
        goto error;
    }
    if (os_timer_create(&attMtuExchangeTimer_, BLE_ATT_MTU_EXCHANGE_DELAY_MS, onAttMtuExchangeTimerExpired, this, true, nullptr)) {
        attMtuExchangeTimer_ = nullptr;
        LOG(ERROR, "os_timer_create() failed.");
        goto error;
    }
    gattcImpl.instance = this;
    NRF_SDH_BLE_OBSERVER(bleGattClient, 1, processGattClientEvents, &gattcImpl);
    gattcInitialized_ = true;
    return SYSTEM_ERROR_NONE;
error:
    if(discoverySemaphore_) {
        os_semaphore_destroy(discoverySemaphore_);
        discoverySemaphore_ = nullptr;
    }
    if(readSemaphore_) {
        os_semaphore_destroy(readSemaphore_);
        readSemaphore_ = nullptr;
    }
    if(writeSemaphore_) {
        os_semaphore_destroy(writeSemaphore_);
        writeSemaphore_ = nullptr;
    }
    if (attMtuExchangeTimer_) {
        os_timer_destroy(attMtuExchangeTimer_, nullptr);
        attMtuExchangeTimer_ = nullptr;
    }
    return SYSTEM_ERROR_INTERNAL;
}

