particle-iot/device-os/hal/src/nRF52840/ble_hal.cpp
int BleObject::GattClient::exchangeAttMtu(hal_ble_conn_handle_t connHandle) {
    CHECK_FALSE(BleObject::getInstance().connMgr()->attMtuExchanged(connHandle), SYSTEM_ERROR_INVALID_STATE);
    ssize_t curAttMtu = BleObject::getInstance().connMgr()->getAttMtu(connHandle);
    CHECK_TRUE(curAttMtu >= BLE_MIN_ATT_MTU_SIZE, SYSTEM_ERROR_NOT_FOUND);
    size_t desiredAttMtu = BleObject::getInstance().gatts()->getDesiredAttMtu();
    CHECK_TRUE(curAttMtu != (ssize_t)desiredAttMtu, SYSTEM_ERROR_NONE);
    if (os_timer_is_active(attMtuExchangeTimer_, nullptr) && attMtuExchangeConnHandle_ == connHandle) {
        attMtuExchangeConnHandle_ = BLE_INVALID_CONN_HANDLE;
        os_timer_change(attMtuExchangeTimer_, OS_TIMER_CHANGE_STOP, false, 0, 0, nullptr);
    }
    LOG_DEBUG(TRACE, "Request to change ATT_MTU from %d to %d for connection: %d", curAttMtu, desiredAttMtu, connHandle);
    int ret = sd_ble_gattc_exchange_mtu_request(connHandle, desiredAttMtu);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gattc_exchange_mtu_request() failed: %d.", ret);
        return nrf_system_error(ret);
    }
    return SYSTEM_ERROR_NONE;
}

void BleObject::GattClient::onAttMtuExchangeTimerExpired(os_timer_t timer) {
    GattClient* gattc;
    os_timer_get_id(timer, (void**)&gattc);
    if (gattc->exchangeAttMtu(gattc->attMtuExchangeConnHandle_) == SYSTEM_ERROR_BUSY) {
        gattc->attMtuExchangeRetries_--;
        if (gattc->attMtuExchangeRetries_ > 0) {
            LOG_DEBUG(TRACE, "Retry to perform ATT MTU exchange procedure.");
            os_timer_change(gattc->attMtuExchangeTimer_, OS_TIMER_CHANGE_START, false, 0, 0, nullptr);
        } else {
            LOG(ERROR, "Automatically perform ATT MTU exchange procedure failed.");
        }
    }
}

int BleObject::GattClient::processSvcDiscEventFromThread(const ble_evt_t* event) {
    if (!isDiscovering_ || currDiscProcedure_ != DiscoveryProcedure::BLE_DISCOVERY_PROCEDURE_SERVICES ||
            event->evt.gattc_evt.conn_handle != currDiscConnHandle_) {
        return SYSTEM_ERROR_INVALID_STATE;
    }
    if (event->header.evt_id == BLE_GATTC_EVT_PRIM_SRVC_DISC_RSP) {
        const ble_gattc_evt_prim_srvc_disc_rsp_t& primSvcDiscRsp = event->evt.gattc_evt.params.prim_srvc_disc_rsp;
        if (event->evt.gattc_evt.gatt_status == BLE_GATT_STATUS_SUCCESS) {
            for (uint8_t i = 0; i < primSvcDiscRsp.count; i++) {
                hal_ble_svc_t service = {};
                service.version = BLE_API_VERSION;
                service.size = sizeof(hal_ble_svc_t);
                service.start_handle = primSvcDiscRsp.services[i].handle_range.start_handle;
                service.end_handle = primSvcDiscRsp.services[i].handle_range.end_handle;
                BleObject::toHalUUID(&primSvcDiscRsp.services[i].uuid, &service.uuid);
                if (!discServices_.append(service)) {
                    LOG(ERROR, "Failed to append discovered service.");
                    // Falls down to continue or finalize the service discovery procedure.
                }
            }
            hal_ble_attr_handle_t currEndHandle = primSvcDiscRsp.services[primSvcDiscRsp.count - 1].handle_range.end_handle;
            if (discoverAll_ && currEndHandle < SERVICES_TOP_END_HANDLE) {
                // Continue discovering services.
                if (sd_ble_gattc_primary_services_discover(currDiscConnHandle_, currEndHandle + 1, nullptr) == NRF_SUCCESS) {
                    return SYSTEM_ERROR_NONE;
                }
                LOG(ERROR, "sd_ble_gattc_primary_services_discover() failed");
            }
        }
    } else if (event->header.evt_id == BLE_GATTC_EVT_READ_RSP) {
        const ble_gattc_evt_read_rsp_t& readRsp = event->evt.gattc_evt.params.read_rsp;
        if (event->evt.gattc_evt.gatt_status == BLE_GATT_STATUS_SUCCESS) {
            hal_ble_svc_t* service = findDiscoveredService(readRsp.handle);
            if (service) {
                service->uuid.type = BLE_UUID_TYPE_128BIT;
                memcpy(service->uuid.uuid128, readRsp.data, BLE_SIG_UUID_128BIT_LEN);
            }
        }
    } else {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }
    // Iterate the discovered services to read 128-bits service UUID as needed.
    if (readServiceUUID128IfNeeded()) {
        return SYSTEM_ERROR_NONE;
    }
    // Service discovery procedure has completed.
    isDiscovering_ = false;
    if (discSvcCallback_) {
        hal_ble_svc_discovered_evt_t svcDiscEvent = {};
        svcDiscEvent.conn_handle = currDiscConnHandle_;
        svcDiscEvent.count = discServices_.size();
        svcDiscEvent.services = discServices_.data();
        discSvcCallback_(&svcDiscEvent, discSvcContext_);
    }
    os_semaphore_give(discoverySemaphore_, false);
    return SYSTEM_ERROR_NONE;
}

int BleObject::GattClient::processCharDiscEventFromThread(const ble_evt_t* event) {
    if (!isDiscovering_ || event->evt.gattc_evt.conn_handle != currDiscConnHandle_) {
        return SYSTEM_ERROR_INVALID_STATE;
    }
    if (currDiscProcedure_ != DiscoveryProcedure::BLE_DISCOVERY_PROCEDURE_DESCRIPTORS &&
            currDiscProcedure_ != DiscoveryProcedure::BLE_DISCOVERY_PROCEDURE_CHARACTERISTICS) {
        return SYSTEM_ERROR_INVALID_STATE;
    }
    if (currDiscProcedure_ == DiscoveryProcedure::BLE_DISCOVERY_PROCEDURE_CHARACTERISTICS) {
        if (event->header.evt_id == BLE_GATTC_EVT_CHAR_DISC_RSP) {
            const ble_gattc_evt_char_disc_rsp_t& charDiscRsp = event->evt.gattc_evt.params.char_disc_rsp;
            if (event->evt.gattc_evt.gatt_status == BLE_GATT_STATUS_SUCCESS) {
                for (uint8_t i = 0; i < charDiscRsp.count; i++) {
                    hal_ble_char_t characteristic = {};
                    characteristic.version = BLE_API_VERSION;
                    characteristic.size = sizeof(hal_ble_char_t);
                    characteristic.char_ext_props = charDiscRsp.chars[i].char_ext_props;
                    characteristic.properties = toHalCharProps(charDiscRsp.chars[i].char_props);
                    characteristic.charHandles.version = BLE_API_VERSION;
                    characteristic.charHandles.size = sizeof(hal_ble_char_handles_t);
                    characteristic.charHandles.decl_handle = charDiscRsp.chars[i].handle_decl;
                    characteristic.charHandles.value_handle = charDiscRsp.chars[i].handle_value;
                    BleObject::toHalUUID(&charDiscRsp.chars[i].uuid, &characteristic.uuid);
                    if (!discCharacteristics_.append(characteristic)) {
                        LOG(ERROR, "Failed to append discovered characteristic.");
                        // Falls down to continue or finalize the characteristic discovery procedure.
                    }
                }
                hal_ble_attr_handle_t currEndHandle = charDiscRsp.chars[charDiscRsp.count - 1].handle_value;
                if (currEndHandle < currDiscSvc_.end_handle) {
                    // Continue discovering characteristics.
                    ble_gattc_handle_range_t handleRange = {};
                    handleRange.start_handle = currEndHandle + 1;
                    handleRange.end_handle = currDiscSvc_.end_handle;
                    if (sd_ble_gattc_characteristics_discover(currDiscConnHandle_, &handleRange) == NRF_SUCCESS) {
                        return SYSTEM_ERROR_NONE;
                    }
                    LOG(ERROR, "sd_ble_gattc_characteristics_discover() failed");
                }
            }
        } else if (event->header.evt_id == BLE_GATTC_EVT_READ_RSP) {
            const ble_gattc_evt_read_rsp_t& readRsp = event->evt.gattc_evt.params.read_rsp;
            if (event->evt.gattc_evt.gatt_status == BLE_GATT_STATUS_SUCCESS) {
                hal_ble_char_t* characteristic = findDiscoveredCharacteristic(readRsp.handle);
                if (characteristic) {
                    characteristic->uuid.type = BLE_UUID_TYPE_128BIT;
                    memcpy(characteristic->uuid.uuid128, &readRsp.data[3], BLE_SIG_UUID_128BIT_LEN);
                }
            }
        } else {
            return SYSTEM_ERROR_INVALID_ARGUMENT;
        }
        // Iterate the discovered services to read 128-bits service UUID as needed.
        if (readCharacteristicUUID128IfNeeded()) {
            return SYSTEM_ERROR_NONE;
        }
        // Start discovering descriptors.
        currDiscProcedure_ = DiscoveryProcedure::BLE_DISCOVERY_PROCEDURE_DESCRIPTORS;
        ble_gattc_handle_range_t handleRange = {};
        handleRange.start_handle = currDiscSvc_.start_handle;
        handleRange.end_handle = currDiscSvc_.end_handle;
        if (sd_ble_gattc_descriptors_discover(currDiscConnHandle_, &handleRange) == NRF_SUCCESS) {
            return SYSTEM_ERROR_NONE;
        }
        LOG(ERROR, "sd_ble_gattc_descriptors_discover() failed");
    } else {
        // Descriptors discovered.
        if (event->header.evt_id != BLE_GATTC_EVT_DESC_DISC_RSP) {
            return SYSTEM_ERROR_INVALID_ARGUMENT;
        }
        const ble_gattc_evt_desc_disc_rsp_t& descDiscRsp = event->evt.gattc_evt.params.desc_disc_rsp;
        if (event->evt.gattc_evt.gatt_status == BLE_GATT_STATUS_SUCCESS) {
            for (uint8_t i = 0; i < descDiscRsp.count; i++) {
                // It will report all attributes, filter descriptors only.
                if (descDiscRsp.descs[i].uuid.type != BLE_UUID_TYPE_BLE) {
                    continue;
                }
                hal_ble_char_t* characteristic = findDiscoveredCharacteristic(descDiscRsp.descs[i].handle);
                if (characteristic) {
                    switch (descDiscRsp.descs[i].uuid.uuid) {
                        case BLE_SIG_UUID_CHAR_USER_DESCRIPTION_DESC: {
                            characteristic->charHandles.user_desc_handle = descDiscRsp.descs[i].handle;
                        } break;
                        case BLE_SIG_UUID_CLIENT_CHAR_CONFIG_DESC: {
                            characteristic->charHandles.cccd_handle = descDiscRsp.descs[i].handle;
                        } break;
                        case BLE_SIG_UUID_SERVER_CHAR_CONFIG_DESC: {
                            characteristic->charHandles.sccd_handle = descDiscRsp.descs[i].handle;
                        } break;
                        case BLE_SIG_UUID_CHAR_EXTENDED_PROPERTIES_DESC:
                        case BLE_SIG_UUID_CHAR_PRESENT_FORMAT_DESC:
                        case BLE_SIG_UUID_CHAR_AGGREGATE_FORMAT:
                        default: break;
                    }
                }
            }
            hal_ble_attr_handle_t currEndHandle = descDiscRsp.descs[descDiscRsp.count - 1].handle;
            if (currEndHandle < currDiscSvc_.end_handle) {
                // Continue discovering descriptors.
                ble_gattc_handle_range_t handleRange = {};
                handleRange.start_handle = currEndHandle + 1;
                handleRange.end_handle = currDiscSvc_.end_handle;
                if (sd_ble_gattc_descriptors_discover(currDiscConnHandle_, &handleRange) == NRF_SUCCESS) {
                    return SYSTEM_ERROR_NONE;
                }
                LOG(ERROR, "sd_ble_gattc_descriptors_discover() failed");
            }
        }
    }
    // Characteristic discovery procedure has completed.
    isDiscovering_ = false;
    if (discCharCallback_) {
        hal_ble_char_discovered_evt_t charDiscEvent = {};
        charDiscEvent.conn_handle = currDiscConnHandle_;
        charDiscEvent.count = discCharacteristics_.size();
        charDiscEvent.characteristics = discCharacteristics_.data();
        discCharCallback_(&charDiscEvent, discCharContext_);
    }
    os_semaphore_give(discoverySemaphore_, false);
    return SYSTEM_ERROR_NONE;
}

int BleObject::GattClient::processDescDiscEventFromThread(const ble_evt_t* event) {
    if (!isDiscovering_ || currDiscProcedure_ != DiscoveryProcedure::BLE_DISCOVERY_PROCEDURE_DESCRIPTORS ||
            event->evt.gattc_evt.conn_handle != currDiscConnHandle_) {
        return SYSTEM_ERROR_INVALID_STATE;
    }
    return processCharDiscEventFromThread(event);
}

