particle-iot/device-os/hal/src/nRF52840/ble_hal.cpp
int BleObject::GattClient::processDataReadEventFromThread(const ble_evt_t* event) {
    const ble_gattc_evt_read_rsp_t& readRsp = event->evt.gattc_evt.params.read_rsp;
    // If this event is responding to the read 128-bits UUID command.
    if (isDiscovering_ && event->evt.gattc_evt.conn_handle == currDiscConnHandle_) {
        if (currDiscProcedure_ == DiscoveryProcedure::BLE_DISCOVERY_PROCEDURE_SERVICES) {
            return processSvcDiscEventFromThread(event);
        } else if (currDiscProcedure_ == DiscoveryProcedure::BLE_DISCOVERY_PROCEDURE_CHARACTERISTICS) {
            return processCharDiscEventFromThread(event);
        } else {
            return SYSTEM_ERROR_INVALID_STATE;
        }
    }
    // Otherwise, this event is responding to the read command.
    if (isReading_ && currReadConnHandle_ == event->evt.gattc_evt.conn_handle) {
        if (event->evt.gattc_evt.gatt_status == BLE_GATT_STATUS_SUCCESS) {
            if (readAttrHandle_ == readRsp.handle && readBuf_ != nullptr) {
                readLen_ = std::min(readLen_, (size_t)readRsp.len);
                memcpy(readBuf_, readRsp.data, readLen_);
            }
        } else {
            LOG(ERROR, "BLE read characteristic failed: %d, handle: %d.", event->evt.gattc_evt.gatt_status, event->evt.gattc_evt.error_handle);
        }
        isReading_ = false;
        os_semaphore_give(readSemaphore_, false);
    }
    return SYSTEM_ERROR_NONE;
}

int BleObject::GattClient::processDataNotifiedEventFromThread(ble_evt_t* event) {
    ble_gattc_evt_hvx_t& hvx = event->evt.gattc_evt.params.hvx;
    if (hvx.type == BLE_GATT_HVX_INDICATION) {
        int ret = sd_ble_gattc_hv_confirm(event->evt.gattc_evt.conn_handle, hvx.handle);
        if (ret != NRF_SUCCESS) {
            LOG(ERROR, "sd_ble_gattc_hv_confirm() failed: %u", (unsigned)ret);
            return nrf_system_error(ret);
        }
    }
    hal_ble_char_evt_t charEvent = {};
    charEvent.conn_handle = event->evt.gattc_evt.conn_handle;
    charEvent.attr_handle = hvx.handle;
    charEvent.type = BLE_EVT_DATA_NOTIFIED;
    charEvent.params.data_written.offset = 0;
    charEvent.params.data_written.len = hvx.len;
    charEvent.params.data_written.data = hvx.data;
    for (const auto& publisher : publishers_) {
        if (publisher.connHandle == event->evt.gattc_evt.conn_handle && publisher.valueHandle == hvx.handle) {
            if (publisher.callback) {
                publisher.callback(&charEvent, publisher.context);
            }
            return SYSTEM_ERROR_NONE;
        }
    }
    return SYSTEM_ERROR_NOT_FOUND;
}

void BleObject::GattClient::processGattClientEvents(const ble_evt_t* event, void* context) {
    GattClient* gattc = static_cast<GattClientImpl*>(context)->instance;
    switch (event->header.evt_id) {
        case BLE_GAP_EVT_CONNECTED: {
            // FIXME: multiple links are established while the timer is active
            if (!os_timer_is_active(gattc->attMtuExchangeTimer_, nullptr)) {
                if (!os_timer_change(gattc->attMtuExchangeTimer_, OS_TIMER_CHANGE_START, true, 0, 0, nullptr)) {
                    LOG_DEBUG(TRACE, "Attempts to exchange ATT_MTU if needed.");
                    gattc->attMtuExchangeConnHandle_ = event->evt.gap_evt.conn_handle;
                    gattc->attMtuExchangeRetries_ = gattc->ATT_MTU_AUTO_EXCHANGE_RETRIES;
                }
            }
            break;
        }
        case BLE_GAP_EVT_DISCONNECTED: {
            if (gattc->isDiscovering_ && event->evt.gap_evt.conn_handle == gattc->currDiscConnHandle_) {
                gattc->isDiscovering_ = false;
                os_semaphore_give(gattc->discoverySemaphore_, false);
                // TODO: Use a flag to indicate the failure as the returned value for the discovery functions.
            }
            if (gattc->isReading_ && gattc->currReadConnHandle_ == event->evt.gattc_evt.conn_handle) {
                gattc->isReading_ = false;
                os_semaphore_give(gattc->readSemaphore_, false);
            }
            if (gattc->isWriting_ && gattc->currWriteConnHandle_ == event->evt.gattc_evt.conn_handle) {
                gattc->isWriting_ = false;
                os_semaphore_give(gattc->writeSemaphore_, false);
            }
            if (os_timer_is_active(gattc->attMtuExchangeTimer_, nullptr) && gattc->attMtuExchangeConnHandle_ == event->evt.gap_evt.conn_handle) {
                gattc->attMtuExchangeConnHandle_ = BLE_INVALID_CONN_HANDLE;
                os_timer_change(gattc->attMtuExchangeTimer_, OS_TIMER_CHANGE_STOP, false, 0, 0, nullptr);
            }
            break;
        }
        case BLE_GATTC_EVT_PRIM_SRVC_DISC_RSP: {
            LOG_DEBUG(TRACE, "BLE GATTC event: services discovered.");
            if (!gattc->isDiscovering_ || gattc->currDiscProcedure_ != DiscoveryProcedure::BLE_DISCOVERY_PROCEDURE_SERVICES ||
                    event->evt.gattc_evt.conn_handle != gattc->currDiscConnHandle_) {
                break;
            }
            ble_evt_t* svcDiscEvent = (ble_evt_t*)BleObject::getInstance().dispatcher()->allocEventData(sizeof(ble_evt_t) +
                    SUB1(event->evt.gattc_evt.params.prim_srvc_disc_rsp.count) * sizeof(ble_gattc_service_t));
            if (!svcDiscEvent) {
                LOG(ERROR, "Allocate memory for discovered services failed.");
                // Assert it since the discovered services are incomplete.
                SPARK_ASSERT(false);
                break;
            }
            memcpy(svcDiscEvent, event, sizeof(ble_evt_t));
            ble_gattc_evt_prim_srvc_disc_rsp_t& primSvcDiscRsp = svcDiscEvent->evt.gattc_evt.params.prim_srvc_disc_rsp;
            memcpy(primSvcDiscRsp.services, event->evt.gattc_evt.params.prim_srvc_disc_rsp.services, primSvcDiscRsp.count * sizeof(ble_gattc_service_t));
            BleObject::getInstance().dispatcher()->enqueue(&svcDiscEvent);
            break;
        }
        case BLE_GATTC_EVT_CHAR_DISC_RSP: {
            LOG_DEBUG(TRACE, "BLE GATTC event: characteristics discovered.");
            if (!gattc->isDiscovering_ || gattc->currDiscProcedure_ != DiscoveryProcedure::BLE_DISCOVERY_PROCEDURE_CHARACTERISTICS ||
                    event->evt.gattc_evt.conn_handle != gattc->currDiscConnHandle_) {
                break;
            }
            ble_evt_t* charDiscEvent = (ble_evt_t*)BleObject::getInstance().dispatcher()->allocEventData(sizeof(ble_evt_t) +
                    SUB1(event->evt.gattc_evt.params.char_disc_rsp.count) * sizeof(ble_gattc_char_t));
            if (!charDiscEvent) {
                LOG(ERROR, "Allocate memory for discovered characteristics failed.");
                // Assert it since the discovered characteristics are incomplete.
                SPARK_ASSERT(false);
                break;
            }
            memcpy(charDiscEvent, event, sizeof(ble_evt_t));
            ble_gattc_evt_char_disc_rsp_t& charDiscRsp = charDiscEvent->evt.gattc_evt.params.char_disc_rsp;
            memcpy(charDiscRsp.chars, event->evt.gattc_evt.params.char_disc_rsp.chars, charDiscRsp.count * sizeof(ble_gattc_char_t));
            BleObject::getInstance().dispatcher()->enqueue(&charDiscEvent);
            break;
        }
        case BLE_GATTC_EVT_DESC_DISC_RSP: {
            LOG_DEBUG(TRACE, "BLE GATTC event: descriptors discovered.");
            if (!gattc->isDiscovering_ || gattc->currDiscProcedure_ != DiscoveryProcedure::BLE_DISCOVERY_PROCEDURE_DESCRIPTORS ||
                    event->evt.gattc_evt.conn_handle != gattc->currDiscConnHandle_) {
                return;
            }
            ble_evt_t* descDiscEvent = (ble_evt_t*)BleObject::getInstance().dispatcher()->allocEventData(sizeof(ble_evt_t) +
                    SUB1(event->evt.gattc_evt.params.desc_disc_rsp.count) * sizeof(ble_gattc_desc_t));
            if (!descDiscEvent) {
                LOG(ERROR, "Allocate memory for discovered descriptors failed.");
                // Assert it since the discovered descriptors are incomplete.
                SPARK_ASSERT(false);
                break;
            }
            memcpy(descDiscEvent, event, sizeof(ble_evt_t));
            ble_gattc_evt_desc_disc_rsp_t& descDiscRsp = descDiscEvent->evt.gattc_evt.params.desc_disc_rsp;
            memcpy(descDiscRsp.descs, event->evt.gattc_evt.params.desc_disc_rsp.descs, descDiscRsp.count * sizeof(ble_gattc_desc_t));
            BleObject::getInstance().dispatcher()->enqueue(&descDiscEvent);
            break;
        }
        case BLE_GATTC_EVT_READ_RSP: {
            LOG_DEBUG(TRACE, "BLE GATT Client event: read response.");
            ble_evt_t* readRspEvent = (ble_evt_t*)BleObject::getInstance().dispatcher()->allocEventData(sizeof(ble_evt_t) +
                    SUB1(event->evt.gattc_evt.params.read_rsp.len) * sizeof(uint8_t));
            if (!readRspEvent) {
                LOG(ERROR, "Allocate memory for read response failed.");
                if (gattc->isReading_ && gattc->currReadConnHandle_ == event->evt.gattc_evt.conn_handle) {
                    gattc->isReading_ = false;
                    os_semaphore_give(gattc->readSemaphore_, false);
                }
                break;
            }
            memcpy(readRspEvent, event, sizeof(ble_evt_t));
            ble_gattc_evt_read_rsp_t& readRsp = readRspEvent->evt.gattc_evt.params.read_rsp;
            memcpy(readRsp.data, event->evt.gattc_evt.params.read_rsp.data, readRsp.len);
            BleObject::getInstance().dispatcher()->enqueue(&readRspEvent);
            break;
        }
        case BLE_GATTC_EVT_WRITE_RSP: {
            LOG_DEBUG(TRACE, "BLE GATT Client event: write with response completed.");
            if (gattc->isWriting_ && gattc->currWriteConnHandle_ == event->evt.gattc_evt.conn_handle) {
                gattc->isWriting_ = false;
                os_semaphore_give(gattc->writeSemaphore_, false);
            }
            break;
        }
        case BLE_GATTC_EVT_WRITE_CMD_TX_COMPLETE: {
            LOG_DEBUG(TRACE, "BLE GATT Client event: write without response completed.");
            if (gattc->isWriting_ && gattc->currWriteConnHandle_ == event->evt.gattc_evt.conn_handle) {
                gattc->isWriting_ = false;
                os_semaphore_give(gattc->writeSemaphore_, false);
            }
            break;
        }
        case BLE_GATTC_EVT_HVX: {
            LOG_DEBUG(TRACE, "BLE GATT Client event: data notified.");
            ble_evt_t* dataNotifiedEvent = (ble_evt_t*)BleObject::getInstance().dispatcher()->allocEventData(sizeof(ble_evt_t) +
                    SUB1(event->evt.gattc_evt.params.hvx.len) * sizeof(uint8_t));
            if (!dataNotifiedEvent) {
                LOG(ERROR, "Allocate memory for received data failed.");
                break;
            }
            memcpy(dataNotifiedEvent, event, sizeof(ble_evt_t));
            ble_gattc_evt_hvx_t& hvx = dataNotifiedEvent->evt.gattc_evt.params.hvx;
            memcpy(hvx.data, event->evt.gattc_evt.params.hvx.data, hvx.len);
            BleObject::getInstance().dispatcher()->enqueue(&dataNotifiedEvent);
            break;
        }
        case BLE_GATTC_EVT_EXCHANGE_MTU_RSP: {
            LOG_DEBUG(TRACE, "BLE GAP event: exchange MTU response.");
            ble_evt_t* attMtuExchangeEvent = (ble_evt_t*)BleObject::getInstance().dispatcher()->allocEventData(sizeof(ble_evt_t));
            if (!attMtuExchangeEvent) {
                LOG(ERROR, "Allocate memory for BLE event failed.");
                SPARK_ASSERT(false);
                break;
            }
            memcpy(attMtuExchangeEvent, event, sizeof(ble_evt_t));
            BleObject::getInstance().dispatcher()->enqueue(&attMtuExchangeEvent);
            break;
        }
        case BLE_GATTC_EVT_TIMEOUT: {
            LOG_DEBUG(TRACE, "BLE GATT Client event: timeout, conn handle: %d, source: %d",
                    event->evt.gattc_evt.conn_handle, event->evt.gattc_evt.params.timeout.src);
            // Disconnect on GATT Client timeout event.
            int ret = sd_ble_gap_disconnect(event->evt.gattc_evt.conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            if (ret != NRF_SUCCESS) {
                LOG(ERROR, "sd_ble_gap_disconnect() failed: %u", (unsigned)ret);
            }
            break;
        }
        default: {
            break;
        }
    }
}

bool BleObject::initialized_ = false;

BleObject& BleObject::getInstance() {
    static BleObject instance;
    return instance;
}

int BleObject::init() {
    if (initialized_) {
        return SYSTEM_ERROR_NONE;
    }
    // Configure the BLE stack using the default settings.
    // Fetch the start address of the application RAM.
    uint32_t appRamStart = 0;
    int ret = nrf_sdh_ble_default_cfg_set(BLE_CONN_CFG_TAG, &appRamStart);
    CHECK_NRF_RETURN(ret, nrf_system_error(ret));
    LOG_DEBUG(TRACE, "APP RAM start: 0x%08x", (unsigned)appRamStart);
    // Enable the stack
    uint32_t sdRamEnd = appRamStart;
    ret = nrf_sdh_ble_enable(&sdRamEnd);
    LOG_DEBUG(TRACE, "SoftDevice RAM end: 0x%08x", (unsigned)sdRamEnd);
    if (sdRamEnd >= appRamStart) {
        LOG(ERROR, "Need to change APP_RAM_BASE in linker script to be large than: 0x%08x", (unsigned)sdRamEnd - 0x20000000);
    }
    SPARK_ASSERT(sdRamEnd < appRamStart);
    CHECK_NRF_RETURN(ret, nrf_system_error(ret));
    /*
     * NOTE: Once the following initializations are successful, the pointers are associated with SoftDevice
     * event handler. Thus we cannot destroy these pointers, unless the whole BLE stack is disabled, which
     * will also disable the mesh functionality temporarily.
     */
    if (!dispatcher_) {
        dispatcher_.reset(new(std::nothrow) BleEventDispatcher());
        CHECK_TRUE(dispatcher_, SYSTEM_ERROR_NO_MEMORY);
    }
    if (!dispatcher_->initialized()) {
        CHECK(dispatcher_->init());
    }
    if (!gap_) {
        gap_.reset(new(std::nothrow) BleGap());
        CHECK_TRUE(gap_, SYSTEM_ERROR_NO_MEMORY);
    }
    if (!gap_->initialized()) {
        CHECK(gap_->init());
    }
    if (!broadcaster_) {
        broadcaster_.reset(new(std::nothrow) Broadcaster());
        CHECK_TRUE(broadcaster_, SYSTEM_ERROR_NO_MEMORY);
    }
    if (!broadcaster_->initialized()) {
        CHECK(broadcaster_->init());
    }
    if (!observer_) {
        observer_.reset(new(std::nothrow) Observer());
        CHECK_TRUE(observer_, SYSTEM_ERROR_NO_MEMORY);
    }
    if (!observer_->initialized()) {
        CHECK(observer_->init());
    }
    if (!connectionsMgr_) {
        connectionsMgr_.reset(new(std::nothrow) ConnectionsManager());
        CHECK_TRUE(connectionsMgr_, SYSTEM_ERROR_NO_MEMORY);
    }
    if (!connectionsMgr_->initialized()) {
        CHECK(connectionsMgr_->init());
    }
    if (!gatts_) {
        gatts_.reset(new(std::nothrow) GattServer());
        CHECK_TRUE(gatts_, SYSTEM_ERROR_NO_MEMORY);
    }
    if (!gatts_->initialized()) {
        CHECK(gatts_->init());
    }
    if (!gattc_) {
        gattc_.reset(new(std::nothrow) GattClient());
        CHECK_TRUE(gattc_, SYSTEM_ERROR_NO_MEMORY);
    }
    if (!gattc_->initialized()) {
        CHECK(gattc_->init());
    }
    initialized_ = true;
    return SYSTEM_ERROR_NONE;
}

bool BleObject::initialized() const {
    return initialized_;
}

